{
    "absolute": {
        "Query": "What is the absolute value?",
        "Mathematics and science": "The absolute value of a number is its numerical value without regard to its sign. For example, the absolute value of -5 is 5.",
        "Music": "Absolute is a brand of compilation albums from EVA Records.",
        "Politics and law": "Absolute liability is a standard of legal liability found in tort and criminal law of various legal jurisdictions.",
        "Philosophy and theology": "Absolute is a philosophical concept that refers to something that is independent, ultimate, or fundamental.",
        "Other": "Absolute construction is a grammatical construction used in certain languages."
    },
    "agent": {
        "Query": "What is the role of an agent in the field of espionage?",
        "Espionage, investigation, and law": "An agent in the field of espionage is a spy or intelligence officer who gathers information and carries out covert operations on behalf of a government or organization.",
        "Arts and entertainment": "In the context of arts and entertainment, an agent is a representative who negotiates contracts and manages the career of actors, musicians, writers, and other creative professionals.",
        "Science and technology": "In the field of science and technology, an agent can refer to a software program or algorithm that performs automated tasks or carries out specific functions, such as an intelligent agent or a software agent.",
        "Computing": "In computing, an agent is a piece of software that acts on behalf of a user or another program, performing tasks or providing services. Examples include user agents, software agents, and intelligent agents."
    },
    "amazon": {
        "Query": "What are the different meanings of the word 'amazon'?",
        "Geography": "Amazon River, in South America\nAmazon rainforest, a rainforest covering most of the Amazon basin",
        "Arts and entertainment": "Amazons, a tribe of female warriors in Greek mythology\nAmazon (Amalgam Comics)\nAmazon, an alias of the Marvel supervillain Man-Killer",
        "Film and television": "The Amazons (1917 film), an American silent tragedy film\nThe Amazon (film), a 1921 German silent film",
        "Gaming": "Amazon (chess), a fairy chess piece\nAmazons (solitaire), a card game",
        "Literature": "Amazons (novel), a 1980 novel co-written by Don DeLillo, published under the pseudonym Cleo Birdwell\nSwallows and Amazons series, twelve children's novels by Arthur Ransome",
        "Music": "The Amazons (band), a British indie band from Reading, Berkshire",
        "Businesses and organizations": "Amazon Bookstore Cooperative, a feminist bookstore (1970–2012)\nAmazonen-Werke, a German agricultural machinery manufacturer (founded 1883)",
        "Military units": "Amazonian Guard, or 'the Amazons', a bodyguard unit of Muammar Gaddafi\nAmazons Company, a Greek ceremonial female battalion",
        "People": "Amazon Eve (born 1979), American model, fitness trainer, and actress\nLesa Lewis (born 1967), American professional bodybuilder nicknamed 'Amazon'",
        "Places": "Amazon Basin (sedimentary basin), a sedimentary basin at the middle and lower course of the river\nAmazon Creek, a stream in Oregon, US",
        "Transportation": "Amazon (automobile), a 1920s British cyclecar\nAmazon, a GWR 3031 Class locomotive operating 1892–1908",
        "Ships": "Amazon (1780 ship), launched in France in 1775 under another name\nAmazon (brigitane), a Canadian brigantine launched 1861, later more famously named Mary Celeste",
        "Other": "Amazon (company), an American multinational technology company"
    },
    "atomic": {
        "Query": "What is atomic?",
        "Physics": "Atomic refers to anything related to the atom, the smallest particle of a chemical element that retains its chemical properties. It can refer to the study of the atom in atomic physics or the time period known as the Atomic Age.",
        "Mathematics": "In order theory, atomic refers to an atom, which is a minimal element in a partially ordered set.",
        "Cocktails": "Atomic is a champagne cocktail that is made with champagne, vodka, and grenadine.",
        "Magazines": "Atomic is an Australian computing and technology magazine.",
        "Skiing": "Atomic is an Austrian ski producer known for manufacturing high-quality skis.",
        "Music": "Atomic can refer to a Norwegian jazz quintet, an album by Lit, an album by Mogwai, a song by Blondie, or a song by Tiger Army."
    },
    "balance": {
        "Query": "What are the different meanings of balance?",
        "Biomechanics": "In biomechanics, balance refers to the ability to maintain equilibrium and control body movements.",
        "Accounting": "In accounting, balance refers to the financial statement that shows the company's assets, liabilities, and equity at a specific point in time.",
        "Mathematics": "In mathematics, balance can refer to the concept of equality or equilibrium in equations or systems.",
        "Film": "In film, Balance is the title of a Bulgarian film released in 1983 and a short animated film released in 1989.",
        "Television": "In television, Balance can refer to a Canadian talk show called 'Balance: Television for Living Well' or an episode of the animated series Justice League titled 'The Balance'.",
        "Music": "In music, Balance can refer to albums by various artists such as Akrobatik, Kim-Lian, Leo Kottke, Joe Morris, Swollen Members, Ty Tabor, Van Halen, and Armin van Buuren.",
        "Game Design": "In game design, balance refers to the concept and practice of tuning relationships between a game's component systems to ensure fair and enjoyable gameplay.",
        "Government and Law": "In government and law, Balance can refer to the BALANCE Act, a proposed US federal legislation, or the criterion for fair allocation of seats among parties or states called 'balance apportionment'."
    },
    "band": {
        "Query": "What are the different meanings of the word 'band'?",
        "Places": "Band, Iran is a village in Urmia County, West Azerbaijan Province, Iran.",
        "People": "Band (surname) is a surname shared by various people.",
        "Arts, entertainment, and media": "A band is a group of people who perform instrumental or vocal music.",
        "Clothing, jewelry, and accessories": "A band can refer to an armband, a smart band, or a wedding band.",
        "Military": "Bands (Italian Army irregulars) were military units in the service of the Italian 'Regio Esercito'.",
        "Science and technology": "In science and technology, a band can refer to a range of frequencies or wavelengths in radio and radar, or the electronic band structure of electrons in solid-state physics.",
        "Society and government": "In First Nations Canada, a band is the primary unit of First Nations Government."
    },
    "bar": {
        "Query": "What are the different types of bars in the legal profession?",
        "Law": "In the legal profession, there are different types of bars such as the state bar, which is an association of lawyers licensed to practice in a particular jurisdiction. There is also the federal bar, which refers to lawyers who are admitted to practice in federal courts. Additionally, there are specialty bars, such as the bar association for criminal defense lawyers or the bar association for intellectual property lawyers."
    },
    "bark": {
        "Query": "What are the different types of bark?",
        "Botany": "In botany, bark refers to the protective outer layer of a woody plant, such as a tree or stick.",
        "Sound": "In the context of animal vocalizations, bark is a common sound made by dogs.",
        "Food": "In the culinary world, almond bark and peppermint bark are confections made with chocolate and various toppings.",
        "Places": "Bark is the name of a municipality in Germany, a village in Poland, and several lakes and rivers in Canada and the United States.",
        "Arts and Entertainment": "Bark is the title of a 1971 album by Jefferson Airplane, a short story collection by Lorrie Moore, and a character in the Sonic the Hedgehog series."
    },
    "base": {
        "Query": "What are the different meanings of the word 'base'?",
        "Brands and enterprises": "Base (mobile telephony provider), a Belgian mobile telecommunications operator",
        "Computing": "BASE (search engine), Bielefeld Academic Search Engine",
        "Mathematics": "Base of computation, commonly called radix, the number of distinct digits in a positional numeral system",
        "Organizations": "BASE (social centre), a self-managed social centre in Bristol, UK",
        "Science and technology": "Base (chemistry), a substance that can accept hydrogen ions (protons)",
        "Social science": "Base (politics), a group of voters who almost always support a single party's candidates",
        "Sports": "Base (baseball), a station that must be touched by a runner",
        "Other uses": "Base (character), character in Marvel Comics"
    },
    "basis": {
        "Query": "What is the basis?",
        "Finance and accounting": "Basis refers to the net cost of an asset after adjusting for various tax-related items, such as adjusted basis, cost basis, and tax basis.",
        "Mathematics and technology": "Basis can refer to various concepts in mathematics and technology, such as basis function, basis in linear algebra, orthonormal basis, polynomial basis, and standard basis.",
        "Chemistry": "In chemistry, basis can refer to the positions of atoms inside the unit cell in crystal structures or the basis set used in computational chemistry.",
        "Organizations": "Basis can also refer to various organizations, such as the Bangladesh Association of Software and Information Services, Basis Educational Group, or Basis Technology Corp."
    },
    "battery": {
        "Query": "What are the different types of batteries used in automobiles?",
        "Electric battery": "An automotive battery is a rechargeable battery that supplies electrical energy to a motor vehicle. It is commonly known as a car battery.",
        "Energy source": "Automotive batteries are typically lead-acid batteries, which are electrochemical devices that convert chemical energy into electrical energy.",
        "Automotive battery": "An automotive battery is a device used to provide electrical power to certain functions of an automobile, such as starting the engine and powering the lights and accessories.",
        "Battery indicator": "A battery indicator is a device that gauges the state of charge of an automotive battery, providing information about its remaining capacity.",
        "List of battery types": "There are various types of batteries used in automobiles, including lead-acid batteries, lithium-ion batteries, and nickel-metal hydride batteries."
    },
    "beam": {
        "Query": "What are the different types of beams in structural engineering?",
        "Science and Technology": "BEAM robotics, also known as biology, electronics, aesthetics, and mechanics robotics, is a style of robotics that combines principles from these different fields to create innovative robotic designs.",
        "Arts, Entertainment and Media": "In the context of arts and entertainment, a beam refers to a connection line in musical notation. It is used to connect multiple notes of the same pitch, indicating that they should be played as a single sustained note.",
        "Businesses": "Beam Suntory, a division of Suntory, is a well-known company in the distilled beverages industry. They produce popular brands like Jim Beam.",
        "Streams of Particles or Energy": "A light beam, or beam of light, is a directional projection of light energy. It can also refer to other types of beams such as laser beams, radio beams, particle beams, and X-ray beams."
    },
    "beat": {
        "Query": "What are the different meanings of the word 'beat'?",
        "Common uses": "In common usage, 'beat' can refer to assault, battery, corporal punishment, patrol, police territory, gay beat, strike, or victory.",
        "People": "In the context of people, 'beat' can refer to a Swiss German male given name or various record producers and musicians with the name 'Beat'.",
        "Arts, entertainment and media": "In arts, entertainment, and media, 'beat' can refer to fictional characters, films, TV series, music groups, albums, songs, music channels, or specific concepts like beat music or drum beat.",
        "Music": "In the field of music, 'beat' can refer to the basic time in music and music theory, a popular music genre, or a rhythmic pattern.",
        "Transportation": "In transportation, 'beat' can refer to a ride-hailing app, a model of paramotor, or specific car models like Chevrolet Beat or Honda Beat.",
        "Other uses in arts, entertainment and media": "In other uses related to arts, entertainment, and media, 'beat' can refer to an intentional pause for emphasis, women's pro soccer teams, a video game, unit of action in acting, or a specific episode of a TV series.",
        "Other uses in music": "In other uses related to music, 'beat' can refer to a pause in dialogue in filmmaking or specific songs and albums.",
        "Other uses in transportation": "In other uses related to transportation, 'beat' can refer to a motor scooter model.",
        "Other uses in common language": "In everyday language, 'beat' can have various meanings depending on the context, such as being tired or exhausted, having a regular rhythm, or defeating someone in a competition."
    },
    "bench": {
        "Query": "What are the different types of benches used in furniture?",
        "Furniture": "A bench (furniture) refers to a long seat that can be used for seating multiple people. It is commonly found in parks, gardens, and public spaces.",
        "Arts": "The Bench (Hogarth) is a painting by William Hogarth depicting a group of people sitting on a bench. It is a famous artwork from the 18th century.",
        "Business": "Bench (Philippine clothing brand) is a popular clothing brand known for its casual and trendy apparel. They offer a wide range of products including shirts, jeans, and accessories.",
        "Geology": "In geology, a bench refers to a long, relatively narrow strip of land with a relatively level or gently inclined surface. It is often found between steeper slopes.",
        "Law and politics": "Bench (law) refers to the location where a judge sits while in court. It can also refer to the judiciary as a whole or a group of judges hearing a case.",
        "People": "Jo Bench is an English death metal bass player known for her work with the band Bolt Thrower. She is considered one of the pioneering female musicians in the genre.",
        "Places": "Bench, Idaho is a small town located in the United States. It is known for its scenic beauty and outdoor recreational activities.",
        "Spoken": "Bench language is spoken by the Bench people, an ethnic group in Ethiopia. It is primarily spoken in the Bench Maji Zone of the country."
    },
    "block": {
        "Query": "What are the different meanings of the word 'block'?",
        "Arts, entertainment and media": "Block programming is a programming strategy in broadcasting where similar shows or content are scheduled together in a block of time.",
        "Music": "Blocks Recording Club is a record label that focuses on experimental and avant-garde music.",
        "Toys": "Toy blocks are small pieces of wood or plastic that children can use to build structures.",
        "Video game": "Blocked is a puzzle game for the iPhone and iPod Touch where players have to navigate through obstacles to reach the goal.",
        "Building and construction": "A breeze block, also known as a cinder block or cement block, is a commonly used concrete masonry unit in construction.",
        "Land subdivisions": "In rural Australia, a block refers to a small agricultural landholding.",
        "Places": "Block Island is an island located in the state of Rhode Island in the United States.",
        "Science and technology": "In meteorology, a block refers to large-scale patterns in the atmospheric pressure field.",
        "Computing": "In computing, a block is a group of declarations and statements treated as a unit in programming.",
        "Engineering": "An engine block, also known as a cylinder block, is the main part of an internal combustion engine.",
        "Medicine": "A nerve block is a deliberate interruption of signals traveling along a nerve, often used for pain relief.",
        "Mathematics": "In graph theory, a block is a maximal biconnected subgraph of a graph.",
        "Sports": "In basketball, a block occurs when a defensive player legally deflects a shot from the opposing team.",
        "Transportation": "In aviation, a block number is a system used to differentiate between groups of aircraft of the same type with minor variants.",
        "People": "Block (Jamie Block) is an anti-folk musician based in New York, US."
    },
    "board": {
        "Query": "What are the different types of boards used in the game of chess?",
        "Recreation": "In the game of chess, different types of boards can be used such as a standard wooden chessboard, a magnetic travel chessboard, or a digital chessboard.",
        "Companies": "Board International is a Swiss software vendor known for its business intelligence software toolkit, but it is not directly related to the game of chess.",
        "Groups": "There are various groups that have boards, such as advisory boards, boards of directors, and boards of trustees, but they are not specifically related to the game of chess.",
        "People": "There are no specific individuals named 'Board' who are related to the game of chess.",
        "Other areas": "There are no specific individuals or concepts related to the game of chess in this category."
    },
    "bolt": {
        "Query": "What is a bolt?",
        "Implements and technology": "A bolt is a threaded shaft used to clamp two components together.",
        "Arts, entertainment, and media": "Bolt is a Disney animated film released in 2008, featuring a dog named Bolt as the main character.",
        "Businesses and organizations": "Bolt is an Estonian transportation network company.",
        "Computing": "Bolt is a network protocol used in database applications.",
        "Places": "Bolt is an unincorporated census-designated place in West Virginia, United States.",
        "Sports": "Bolt is a secondary nickname for the Los Angeles Chargers, a National Football League team.",
        "Vehicles": "Bolt is a subcompact electric hatchback produced by Chevrolet."
    },
    "bond": {
        "Query": "What is a bond?",
        "Finance": "A bond is a type of debt security that represents a loan made by an investor to a borrower, typically a government or corporation. It is used to raise capital and pays periodic interest payments to the bondholder.",
        "Chemistry": "In chemistry, a bond refers to the attraction between atoms, ions, or molecules that allows them to form chemical compounds. These bonds can be covalent, ionic, or metallic.",
        "Emotional": "An emotional bond is an attachment or connection between individuals that is based on feelings of affection, trust, and mutual understanding. It can exist between family members, friends, or romantic partners.",
        "Entertainment": "James Bond is a fictional character created by Ian Fleming, who is a British secret agent known for his adventures in novels and films. The Bond series has become a popular franchise in the entertainment industry.",
        "Places": "Bond Street is a major shopping street in the West End of London, England. It is known for its luxury boutiques and high-end fashion stores.",
        "Brands": "Bonds is an Australian clothing company that specializes in underwear, socks, and clothing for men, women, and children. It is a well-known brand in Australia.",
        "Education": "Bond University is a private university located on the Gold Coast in Australia. It offers undergraduate and postgraduate programs in various fields of study.",
        "Organizations": "Bond is the membership body for UK-based NGOs working in international development. It represents and supports British overseas NGOs for development.",
        "People": "Bond is a common surname, and there are several individuals with this last name. Mr. Bond is an Austrian rapper known for his music.",
        "Outer Space": "Bond is a crater on Mars, which is a visible depression on the surface of the planet."
    },
    "buffer": {
        "Query": "What is a buffer?",
        "Science": "A buffer is a solution used to prevent changes in pH by maintaining a stable hydrogen ion concentration.",
        "Technology and engineering": "A buffer is a device that cushions impacts between vehicles, such as in rail transport.",
        "Computing": "A buffer is a temporary storage area in memory used to hold data while it is being transferred, such as in data buffering.",
        "People": "Buffer can refer to Bruce Buffer, an American sports announcer for UFC events."
    },
    "bug": {
        "Query": "What are the different meanings of the word 'bug'?",
        "Common uses": "A terrestrial arthropod animal (with at least six legs)",
        "Arts, entertainment and media": "Fictional entities",
        "Film and television": "Bug (1975 film), an American horror film",
        "Gaming": "Bug (poker), a limited form of wild card",
        "Music": "Albums",
        "Other uses in arts, entertainment and media": "BUG (magazine), a Croatian magazine",
        "Businesses and organizations": "Bicycle User Group, a group set up to promote cycling issues",
        "People": "Bug Hall (born 1985), an American actor",
        "Places": "Bug (river) or Western Bug, a river in Poland, Ukraine and Belarus",
        "Science and technology": "Slipper lobster (Scyllaridae), a number of species of which are called 'bug'",
        "Transportation": "Bond Bug, a British three-wheeled car"
    },
    "capital": {
        "Query": "What is the capital of France?",
        "Common uses": "The capital of France is Paris.",
        "Economics and social sciences": "In economics, capital refers to the durable produced goods used for further production.",
        "Architecture and buildings": "In architecture, a capital is the topmost member of a column or pilaster.",
        "Arts, entertainment and media": "In literature, 'Capital' is a novel by John Lanchester.",
        "Periodicals": "In periodicals, 'Capital' is a French-language magazine.",
        "Film and television": "In film and television, 'Capital' is a 2012 French drama film.",
        "Music": "In music, 'Capital' is an album by Mick Softley.",
        "Education": "In education, 'Capital' can refer to Capital Community College in Hartford, Connecticut.",
        "Sports": "In sports, 'Capital' can refer to the Washington Capitals, an American ice hockey team.",
        "Transportation": "In transportation, 'Capital' can refer to a 19th-century American steamboat called Capital.",
        "Other uses": "In radio, 'Capital' can refer to a group of radio stations operating across the United Kingdom."
    },
    "carrier": {
        "Query": "What is the carrier?",
        "Entertainment": "Carrier (album), a 2013 album by The Dodos",
        "Science": "Carrier protein, a protein that facilitates the transport of another molecule",
        "Technology": "Aircraft carrier, a warship primarily hosting fixed-wing aircraft"
    },
    "case": {
        "Query": "What are the different types of cases in the legal field?",
        "Business, finance, and law": "In the legal field, there are various types of cases, including criminal cases, civil cases, family law cases, personal injury cases, employment law cases, and intellectual property cases.",
        "Education": "In policy debate, a case refers to the set of arguments presented by a team in support of their position on a given topic.",
        "Language and linguistics": "In linguistics, a case refers to a grammatical category that indicates the relationship between a noun or pronoun and other words in a sentence.",
        "Science, technology, and mathematics": "In computer science, a switch statement is a control statement used to select one of many code blocks to be executed based on the value of a variable or expression."
    },
    "cell": {
        "Query": "What are the different meanings of the word 'cell'?",
        "Biology": "In biology, a cell is the functional basic unit of life.",
        "Arts, Entertainment, and Media": "In arts, entertainment, and media, 'cell' can refer to a Marvel comic book character or a character in the manga series Dragon Ball.",
        "Literature": "In literature, 'cell' can refer to a horror novel by Stephen King or a poem by Rudyard Kipling.",
        "Music": "In music, 'cell' can refer to a small rhythmic and melodic design, an album by Plastic Tree, or a song composed by G. F. Cobb.",
        "Other Arts, Entertainment, and Media": "In other arts, entertainment, and media, 'cell' can refer to a psychological thriller film starring Jennifer Lopez or an episode of TV series like The Vampire Diaries or The Walking Dead.",
        "Groups of People": "In the context of groups of people, 'cell' can refer to a group in a cell group or a unit of a clandestine cell system.",
        "Rooms": "In the context of rooms, 'cell' can refer to a small room in which a religious recluse lives or a room used to hold people in prisons.",
        "Science, Mathematics, and Technology": "In science, mathematics, and technology, 'cell' can refer to a microprocessor architecture, a unit in a database table or spreadsheet, a wireless connection, or a basic unit of computer memory.",
        "Mathematics": "In mathematics, 'cell' can refer to a three-dimensional element, an element of an abstract cell complex, a basic unit of a cellular automaton, or a k-face of a simplicial complex."
    },
    "center": {
        "Query": "What is the center?",
        "Mathematics": "In mathematics, the center refers to the middle point or location of an object or a set of data. It can also refer to the central tendency measures used to describe the average or typical value in a dataset.",
        "Places": "In terms of places, the center can refer to various locations across different states and countries, such as Center, Alabama in the United States or Centre Region in Burkina Faso.",
        "Sports": "In sports, the center can refer to different positions in different sports, such as the center position in basketball or the center fielder position in baseball.",
        "Other countries": "In the context of other countries, the center can refer to regions or departments within those countries, such as Centre-Val de Loire in France or Centre Department in Ivory Coast."
    },
    "channel": {
        "Query": "What are the different types of channels in communication?",
        "Science and technology": "In the context of science and technology, channels can also refer to ion channels. These are proteins that allow the flow of ions across cell membranes, playing a crucial role in various physiological processes.",
        "Business and legal terms": "In the context of business and legal terms, channels refer to distribution channels. These are the paths through which products or services are delivered from the producer to the consumer. Examples of distribution channels include direct sales, retail stores, e-commerce platforms, and wholesalers.",
        "Arts, entertainment, and media": "In the arts, entertainment, and media industry, channels can refer to television channels or broadcasting channels. These are platforms or networks that transmit television programs or radio broadcasts to viewers or listeners. Examples include ABC, NBC, BBC, and CNN.",
        "Sports": "In the field of sports, channels can refer to specific areas of the pitch in football (soccer). For example, the left channel and right channel are commonly used terms to describe the areas on the field where players operate or make runs.",
        "Other uses": "In traditional Chinese medicine, channels are referred to as meridians. These are pathways through which vital energy (qi) flows in the body. Acupuncture and other techniques aim to balance the flow of energy through these channels."
    },
    "character": {
        "Query": "What is the meaning of character?",
        "Arts, entertainment, and media": "In literature, character refers to a person or entity portrayed in a novel or story. It can also refer to a set of character sketches in classical Greek literature.",
        "Music": "In music, character can refer to an album title, such as 'Characters' by John Abercrombie or 'Character' by Dark Tranquillity.",
        "Types of entity": "In the context of arts, character refers to an agent within a work of art, such as a novel, drama, or video game. It can also refer to a character sketch or description of a character type.",
        "Other uses in arts, entertainment, and media": "In film, 'Character' is a Dutch film based on the novel by Ferdinand Bordewijk. It can also refer to a monthly magazine called 'Charaktery' in Poland or a sketch comedy show on Netflix called 'Netflix Presents: The Characters'.",
        "Mathematics": "In mathematics, character can refer to a homomorphism from a group to a field, or the logical equivalency between objects of two different domains. It is also associated with character theory and specific types of characters in number theory.",
        "Morality and social science": "In the context of morality and social science, character can refer to character education, which is values education in the US. It can also refer to a person's traits or an evaluation of an individual's durable moral qualities.",
        "Symbols": "In symbols, character can refer to a sign or symbol, or a unit of information in computing roughly corresponding to a grapheme."
    },
    "charge": {
        "Query": "What is the charge of an electron?",
        "Mathematics, science, and technology": "The charge of an electron is -1.602 x 10^-19 coulombs.",
        "Physics": "The charge of an electron is -1.602 x 10^-19 coulombs.",
        "Chemistry": "The charge of an electron is -1.602 x 10^-19 coulombs.",
        "Electrical Engineering": "The charge of an electron is -1.602 x 10^-19 coulombs."
    },
    "check": {
        "Query": "What are the different meanings of the word 'check'?",
        "Places": "Check, Virginia is a small town located in Floyd County, Virginia.",
        "Arts, entertainment, and media": "Check is a 2021 Indian Telugu-language film. The Checks is also an episode of the TV show Seinfeld.",
        "Games and sports": "In chess, a check is a threat to capture the king or general. In poker, 'check' means declining to bet. In ice hockey, checking refers to several techniques used to impede the progress of an opponent. It can also refer to a poker chip.",
        "Music": "There are several songs titled 'Check' by different artists such as Meek Mill, Young Thug, Chris Janson, E-40, Kojo Funds, Lil Durk, Max Webster, Nas and Rick Ross, Quin NFN, Qveen Herby, Rustic Overtones, U.S.D.A., and Zebrahead. The Checks is also the name of a New Zealand band.",
        "Computing": "Check is a mobile banking application. It is also a penetration testing certification run by CESG called the CHECK Scheme. Checkbox is a type of widget in computing.",
        "Patterns": "Check (or 'Chequered') is a pattern of squares, often used on chess boards and fabrics. Tartan is a checked pattern commonly found in fabric and weaving.",
        "Other uses": "A check mark is a symbol used to indicate completion, verification, or selection. Checked baggage refers to luggage or parcels placed by an airline or train for transportation. A cheque is an order for the transfer of money. A rain check is an idiom from baseball meaning a deferral. A check is also a receipt presented to a diner at the end of a meal."
    },
    "circuit": {
        "Query": "What are the different types of circuits?",
        "Science and technology": "There are various types of circuits in electrical engineering, such as analog circuits, digital circuits, integrated circuits, printed circuit boards, etc.",
        "Mathematics and computer science": "In computer theory, a circuit can refer to a theoretical structure simulating electrical and data paths, or a Boolean circuit used in digital logic circuits.",
        "Other sciences": "In neuroscience, a circuit can refer to a biological neural network. In physics, a magnetic circuit refers to one or more closed loop paths containing a magnetic flux.",
        "Arts, entertainment, and media": "In the film industry, 'Circuit' is a 2001 gay-themed film set in the world of gay circuit parties. In the Power Rangers series, 'Circuit' is a character from Power Rangers Time Force.",
        "Church": "In the Lutheran Church–Missouri Synod, a circuit is a local grouping of congregations. In Methodism, a circuit is a form of church governance.",
        "Government and law": "In East Asia, a circuit is an administrative country subdivision. In common law jurisdictions, a circuit court is a name given to court systems.",
        "Sports": "In sports, circuit training is a form of high-intensity aerobics. In tennis, the ITF Pro Circuit consists of pro tennis tours organized by the International Tennis Federation.",
        "Transportation and racing": "In aviation, a circuit refers to a standard path followed by aircraft during takeoff or landing. In racing, a circuit can refer to a race track or one complete traverse of a track."
    },
    "class": {
        "Query": "What are the different meanings of the word 'class'?",
        "Biology": "In biology, 'class' is a taxonomic rank used to classify organisms below the phylum and above the order.",
        "Knowledge Representation": "In knowledge representation, 'class' refers to a collection of individuals or objects that share common characteristics or attributes.",
        "Philosophy": "In philosophy, 'class' is an analytical concept used to categorize entities based on their shared properties, distinct from group phenomena like 'types' or 'kinds'.",
        "Set Theory": "In set theory, 'class' is a collection of sets that can be precisely defined by a property shared by all its members.",
        "Hazard Classification": "In hazard classification, 'class' is used to categorize dangerous goods based on their level of risk and potential harm.",
        "Social Class": "In sociology, 'social class' refers to the hierarchical arrangement of individuals in society based on factors like wealth, occupation, and social status.",
        "Arts and Entertainment": "In arts and entertainment, 'class' can refer to a song, a character class in role-playing games, or a radio station.",
        "Films": "In the context of films, 'class' can refer to specific movie titles like 'Class' (1983), 'The Class' (2007), or 'The Class' (2008).",
        "Television": "In television, 'class' can refer to TV series like 'Class' (2010), 'Class' (2016), or 'The Class'.",
        "Literature": "In literature, 'class' can refer to books like 'Class: A Guide Through the American Status System' by Paul Fussell or novels titled 'Class' by Pacifico, Rosenfeld, or Segal.",
        "Computing": "In computing, 'class' is a fundamental concept in object-oriented programming, a group in the warez scene, a data type in C++, a feature in HTML, a construct in computational complexity theory, a Java bytecode file, a pseudo-class in CSS, or a type system construct supporting polymorphism.",
        "Education": "In education, 'class' can refer to a group of students attending a specific course or lesson, a course itself, a lesson or course session, or a physical classroom.",
        "Law and Government": "In law and government, 'class' can refer to a group of people involved in a class action lawsuit or the schedules of elections for United States senators."
    },
    "clean": {
        "Query": "What are the different meanings of the word 'clean'?",
        "Cleaning": "Cleaning refers to the process of removing dirt, impurities, and unwanted substances from an object or environment. It involves activities such as sweeping, mopping, dusting, and disinfecting.",
        "Music": "In the context of music, 'clean' can refer to albums or songs that are free from explicit or offensive content. It can also describe a specific sound or style of vocals.",
        "Film": "In film, 'clean' can refer to a genre or style of comedy that avoids profanity and objectionable material. It can also be the title of a movie, such as the 2004 French drama film 'Clean'.",
        "Sports": "In weightlifting, 'clean' refers to a specific movement called the clean and jerk. It is a two-part lift where the barbell is lifted from the floor to the shoulders and then overhead.",
        "Rock Climbing": "In rock climbing, 'clean climbing' refers to the practice of using non-destructive hardware and techniques. It involves minimizing the impact on the rock and leaving no trace behind.",
        "Python Programming": "In Python programming, 'clean' can refer to writing code that is well-organized, readable, and follows best practices. It emphasizes code clarity and maintainability."
    },
    "clip": {
        "Query": "What are the different types of clips used in the field of fasteners?",
        "Fasteners": "There are several types of clips used in the field of fasteners, such as hair clip, binder clip, bulldog clip, paper clip, climbing clip, crocodile clip, circlip, roach clip, bread clip, rail clip, and money clip."
    },
    "cluster": {
        "Query": "What are the different types of clusters in astronomy?",
        "Science and technology": "In astronomy, there are various types of clusters. Some examples include galaxy clusters, which are large gravitationally bound groups of galaxies, and star clusters, which are spherical collections of stars that can be either globular clusters or open clusters.",
        "Biology and medicine": "Clusters in astronomy are not relevant to biology and medicine.",
        "Computer science": "Clusters in astronomy are not relevant to computer science.",
        "Equipment": "Clusters in astronomy are not relevant to equipment.",
        "Math and statistics": "Clusters in astronomy are not relevant to math and statistics.",
        "Arts and media": "Clusters in astronomy are not relevant to arts and media.",
        "Other uses in science and technology": "Clusters in astronomy are not relevant to other uses in science and technology.",
        "Urban development": "Clusters in astronomy are not relevant to urban development."
    },
    "clustering": {
        "Query": "What are the advantages of clustering in computer networks?",
        "Computer Science": "Clustering in computer networks allows for improved scalability and fault tolerance. By linking multiple computers together, tasks can be distributed and processed in parallel, leading to faster and more efficient computation.",
        "Data Science": "Clustering in computer networks is beneficial for data analysis and pattern recognition. It helps in identifying groups or clusters of similar data points, which can be useful for various applications such as customer segmentation or anomaly detection.",
        "Economics": "In the context of computer networks, clustering can lead to cost savings and resource optimization. By consolidating resources and sharing them among multiple computers, businesses can reduce hardware and maintenance costs.",
        "Graph Theory": "Clustering in computer networks is relevant to graph theory as it involves the identification of densely connected subgraphs. This can be useful for analyzing social networks, identifying communities, or studying the spread of information."
    },
    "complex": {
        "Query": "What is the definition of complex?",
        "Psychology": "In psychology, complex refers to a core pattern of emotions and thoughts organized around a common theme, such as power or status.",
        "Mathematics": "In mathematics, complex refers to an extension of real numbers obtained by adjoining imaginary numbers, and also the study of functions of complex numbers.",
        "Biology": "In biology, complex can refer to a group of associated polypeptide chains forming a protein complex, or a cluster of very similar species difficult to delimit known as a species complex.",
        "Chemistry": "In chemistry, complex can refer to a central atom or ion surrounded by a surrounding array of bound molecules or ions, or a coordination complex with multiple bonds.",
        "Geology": "In geology, complex can refer to a unit of rocks composed of two or three types of rocks, or a group of volcanoes known as a volcanic complex.",
        "Arts": "In arts and entertainment, complex can refer to a Japanese rock band, a 1971 album by the English band Complex, or a publisher of the online magazine Complex.",
        "Computer Science": "In computer science, complex can refer to a complex number, an element of a field of sets, or an algebraic structure known as a chain complex."
    },
    "compound": {
        "Query": "What is the compound?",
        "Architecture and built environments": "Compound (enclosure), a cluster of buildings having a shared purpose, usually inside a fence or wall",
        "Government and law": "Composition (fine), a legal procedure in use after the English Civil War",
        "Linguistics": "Compound (linguistics), a word that consists of more than one radical element",
        "Science, technology, and mathematics": "Biology and medicine: Compounding, the mixing of drugs in pharmacy",
        "Chemistry and materials science": "Chemical compound, combination of two or more elements",
        "Vehicles and engines": "Compound engine, a steam engine in which steam is expanded through a series of two or three cylinders before exhaust",
        "Other uses in science, technology, and mathematics": "Compound bow, a type of bow for archery",
        "Other uses": "Compound interest, in finance, unpaid interest that is added to the principal"
    },
    "conductor": {
        "Query": "What is the role of a conductor in an orchestra?",
        "Music": "A conductor in music is a person who leads and directs an orchestra or a choir. They are responsible for interpreting the musical score, setting the tempo, shaping the dynamics, and coordinating the musicians.",
        "Physics": "In physics, a conductor is a material or substance that allows the flow of electrical current. It has low electrical resistance and high electrical conductivity.",
        "Mathematics": "In mathematics, the conductor of an abelian variety is a measure of its complexity and is related to the behavior of its L-functions. It is a concept used in algebraic number theory and arithmetic geometry."
    },
    "console": {
        "Query": "What is a console?",
        "Computing and video games": "A console is a physical device or user interface used to operate a computer, such as a system console, virtual console, command-line interface, or terminal emulator. It can also refer to specific devices for playing video games, such as a video game console, home video game console, or handheld game console.",
        "Music": "In music, a console can refer to a mixing console, which is a device used for controlling and combining audio signals. It can also refer to an organ console, which includes the keys, stops, and foot pedals for playing music.",
        "Other": "Console can also refer to other specific contexts, such as Console Inc., an American technology startup company, or Konsole, a computer terminal emulator program for the K Desktop Environment."
    },
    "control": {
        "Query": "What are the different types of control in management?",
        "Economics and business": "Control in management refers to the process of monitoring and regulating organizational activities to ensure they are aligned with the goals and objectives of the organization. It includes various types of control such as financial control, operational control, strategic control, and quality control.",
        "Mathematics and science": "In the context of optimal control theory, control refers to a variable that is manipulated to steer a controllable system towards a desired goal. In statistics, controlling for a variable means taking it into account to minimize its impact on the relationship between other variables. Control variables are also used in experiments to keep certain factors constant.",
        "Medicine": "In the medical field, control can refer to the process of stopping or attempting to stop post-procedural bleeding. It can also be the name of certain medications like chlordiazepoxide and lorazepam, which are used for anxiety and other conditions.",
        "Systems engineering, computing and technology": "Control in this context can refer to various aspects such as control engineering, which involves modeling and controlling systems, control systems that enable the control of mechanical or chemical equipment, control theory which is a mathematical theory about controlling dynamical systems, and control flow which specifies the sequence of operations in computer programs.",
        "Society, psychology and sociology": "Control in psychology can refer to various concepts such as locus of control, which is the extent to which individuals believe they can control events that affect them, self-control which is the ability to control one's emotions and desires, and social control which refers to mechanisms that regulate social behavior.",
        "Other basic uses": "In orienteering and related sports, control refers to a marked waypoint. In linguistics, control is a relation between elements of two clauses.",
        "Geography": "Control can also refer to a place called Control in Alberta, Canada.",
        "Books": "Control is the title of a novel by William Goldman and a fictional character in the spy novel Tinker, Tailor, Soldier, Spy.",
        "Film and TV": "There are several films and TV shows with the title Control, including a film about Joy Division singer Ian Curtis and a character in the TV series Person of Interest.",
        "Games": "In the game contract bridge, control and control-bid are features of the game. There is also a video game called Control.",
        "Music": "Control is the name of a character from the rock musical Starlight Express, as well as the title of albums by artists such as Janet Jackson, Pedro the Lion, and SZA."
    },
    "core": {
        "Query": "What is the core?",
        "Science and technology": "The core in science and technology can refer to various things such as the central part of a fruit, the signal-carrying portion of an optical fiber, or the central part of a nuclear reactor containing the fuel components.",
        "Geology and astrophysics": "In geology and astrophysics, the core can refer to the central part of a planet, the inner and outer core of the Earth, or the region of a star where nuclear fusion takes place.",
        "Computing": "In computing, the core can refer to a data visualization API used in macOS, the recorded state of a running program (core dump), or a family of CPUs released by Intel.",
        "Mathematics": "In mathematics, the core can refer to the collection of stable allocations in game theory, the homomorphically minimal subgraph in graph theory, or an object in group theory.",
        "Arts, entertainment and media": "In arts, entertainment, and media, the core can refer to a science fiction novel, a radio station, a video game, or an episode of a cartoon.",
        "Film and television": "In film and television, the core can refer to a specific film or a programming block on a TV channel.",
        "Music": "In music, the core can refer to a stoner rock band, an album by Stone Temple Pilots or Persefone, or a song by Susumu Hirasawa or Eric Clapton.",
        "Organizations": "In organizations, the core can refer to a defunct American computer and technology corporation, a videogame developer, a Brazilian state police SWAT team, or a non-profit organization providing humanitarian relief.",
        "Places": "In places, the core can refer to a neighborhood in San Diego or West Virginia in the United States, or various locations in North Carolina, Spain, Canada, or England.",
        "People": "In people, the core can refer to Earl Lemley Core, a West Virginia botanist, or Ericson Core, an American director and cinematographer."
    },
    "corner": {
        "Query": "What are the different meanings of the word 'corner'?",
        "People": "Corner is a surname, commonly found in English-speaking countries.",
        "Places": "Corner can refer to various locations such as Corner, Alabama in the United States or Corner Inlet in Victoria, Australia.",
        "Music": "The Corner is the title of an album by the Hieroglyphics and a song by Common.",
        "Arts, Entertainment, and Media": "The Corner is a blog from National Review and a TV series based on a book by David Simon & Ed Burns.",
        "Sports": "Corner kick is a method of restarting play in association football, and cornerback is a position in American and Canadian football."
    },
    "corpus": {
        "Query": "What is the function of corpus in linguistics?",
        "Linguistics": "In linguistics, a corpus is a large and structured set of texts that is used for linguistic analysis and research. It provides a representative sample of language usage and helps in studying various linguistic phenomena.",
        "Medicine": "In medicine, the term 'corpus' refers to different anatomical structures such as the corpus callosum, corpus cavernosum, and corpus luteum. It does not have a specific function in the field of linguistics."
    },
    "crack": {
        "Query": "What are the different meanings of the word 'crack'?",
        "Fracture": "Crack, a fracture in a body",
        "Geology": "Crack, a fracture in a rock",
        "Drug": "Crack, short for crack cocaine",
        "Film": "Cracks (film), a 2009 independent thriller",
        "Music": "Crack (band), a Spanish progressive rock group",
        "Magazine": "Crack Magazine, a UK-based European music and culture monthly",
        "Slang": "Crack, carrack",
        "Safe Cracking": "Safe cracking, the process of opening a safe without the combination or the key",
        "Software": "Crack (password software), a UNIX/Linux password hacking program for systems administrators"
    },
    "crane": {
        "Query": "What are the different species of cranes?",
        "Common meanings": "The common species of cranes include the Sandhill Crane, the Whooping Crane, and the Demoiselle Crane.",
        "People and fictional characters": "There are no known people or fictional characters named Crane that are related to different species of cranes.",
        "Places": "There are no known places named Crane that are related to different species of cranes.",
        "United Kingdom": "There are no known locations in the United Kingdom named Crane that are related to different species of cranes.",
        "United States": "There are no known locations in the United States named Crane that are related to different species of cranes.",
        "Businesses": "There are no known businesses named Crane that are related to different species of cranes.",
        "Arts and entertainment": "There are no known arts and entertainment references named Crane that are related to different species of cranes.",
        "Martial arts": "There are no known martial arts techniques or styles named Crane that are related to different species of cranes.",
        "Schools in the United States": "There are no known schools in the United States named Crane that are related to different species of cranes.",
        "Ships": "There are no known ships named Crane that are related to different species of cranes."
    },
    "crash": {
        "Query": "What are the different meanings of the word 'crash'?",
        "Common meanings": "Collision, an impact between two or more objects",
        "Arts and entertainment": "Crash (2004 film), directed by Paul Haggis and winner of the 2005 Academy Award for Best Picture",
        "Television": "Crash (2008 TV series), an American drama based on the 2004 film",
        "Publications": "Crash (J. G. Ballard novel), the basis of the 1996 film",
        "Music": "Crash (Dave Matthews Band album) (1996)",
        "Fictional characters": "Crash, a prehistoric opossum character in the Ice Age franchise",
        "Video games": "Crash Bandicoot, a series of adventure video games",
        "Card games": "Crash (card game), a British card game",
        "People": "Crash (graffiti artist), American artist John Matos (born 1961)",
        "Sports teams": "Indy Crash, a women's full contact football team in the Women's Football Alliance"
    },
    "criterion": {
        "Query": "What is the criterion for determining if a polynomial is irreducible over the rational numbers?",
        "Science and mathematics": "Eisenstein's criterion is a mathematical criterion that gives sufficient conditions for a polynomial to be irreducible over the rational numbers.",
        "Publishing": "The Criterion (journal) was the first philosophy journal in Catalan, published from 1925 to 1969.",
        "Entertainment": "The Criterion Collection is a company that produces collector's edition DVDs and Blu-ray discs."
    },
    "current": {
        "Query": "What is the current?",
        "Science and technology": "Current (fluid), the flow of a liquid or a gas",
        "Arts and entertainment": "Currents (band), an American metal band",
        "Film, television and radio": "Current TV, a defunct television channel in the US",
        "Publications": "Current (newspaper), an American trade journal"
    },
    "cycle": {
        "Query": "What are the different meanings of the word 'cycle'?",
        "Anthropology and social sciences": "Cyclic history, a theory of history",
        "Arts, entertainment, and media": "Cycle (2008 film), a Malayalam film",
        "Literature": "Cycle (magazine), an American motorcycling enthusiast magazine",
        "Music": "Cycle (music), a set of musical pieces that belong together",
        "Albums": "Cycle (album), a 1965 album by the Paul Horn Quintet",
        "Songs": "\"Cycles\", a 1968 song by Frank Sinatra on his album Cycles",
        "Science, technology, and mathematics": "Cycle (gene), a gene in Drosophila melanogaster that encodes the CYCLE protein",
        "Computing": "Cycles, a render engine for the software Blender",
        "Mathematics": "Cycle (algebraic topology), a simplicial chain with 0 boundary",
        "Other uses in science and technology": "Cycle (angular unit), a unit of plane angle or rotation",
        "Vehicles": "Bicycle"
    },
    "date": {
        "Query": "What are the different meanings of the word 'date'?",
        "Date (fruit)": "The date is a fruit that grows on the date palm tree and is commonly consumed as a sweet snack.",
        "Social activity": "Dating refers to a social activity where individuals meet to assess their compatibility as potential partners.",
        "Chronology": "In the context of chronology, a date can refer to a specific day on a calendar or a representation term used to specify a calendar date.",
        "Arts, entertainment and media": "In the entertainment industry, 'Date' can refer to a Swedish dansband or a song titled 'Date' by Mr. Houston.",
        "Film and television": "In the realm of film and television, 'Date' can be an episode of the British sitcom Miranda or a British romantic drama series called Dates.",
        "Places": "Date can be the name of various locations, such as Date in Fukushima, Japan, Date District in Fukushima, Japan, Date in Hokkaido, Japan, Date in South Dakota, United States, Date City in California, United States, or Dateland in Arizona, United States."
    },
    "deck": {
        "Query": "What is a deck?",
        "Buildings and structures": "A deck in the context of buildings and structures refers to an outdoor floor attached to a building made of wood or wood-like material.",
        "Transportation": "In transportation, a deck can refer to the number of passenger levels on a bus.",
        "Maritime": "In maritime terms, a deck is a floor of a ship.",
        "Audiovisual equipment": "In the context of audiovisual equipment, a deck can refer to a cassette deck, which is a type of tape machine for playing and recording compact cassettes.",
        "People": "Deck can also be a surname, such as the surname 'Deck'."
    },
    "deduction": {
        "Query": "What is the process of reasoning from general statements to specific conclusions?",
        "Philosophy": "Deduction is the mental process of drawing inferences in which the truth of their premises ensures the truth of their conclusion.",
        "Mathematics": "Deduction is a logical process in mathematics where conclusions are derived from a set of axioms or premises using logical rules.",
        "Computer Science": "Deduction is a process in computer science where conclusions are derived from a set of logical rules or conditions using algorithms or programming languages.",
        "Law": "Deduction is a legal process where conclusions are derived from a set of legal principles, evidence, and arguments to reach a logical decision or judgment."
    },
    "delta": {
        "Query": "What are the different meanings of the word 'delta'?",
        "Greek Alphabet": "Delta (Δ or δ), a letter of the Greek alphabet",
        "Geography": "River delta, at a river mouth",
        "Transportation": "Delta Air Lines, a major US airline",
        "Medicine": "Delta variant of SARS-CoV-2 that causes COVID-19",
        "Music": "Delta blues, a music style",
        "Mathematics": "Δ (delta), a difference of state between two before and after state schemas in the Z notation",
        "Computing": "Delta encoding or delta compression, in computer communications",
        "Science": "Delta (ligand), an activator of the notch signaling pathway",
        "Vehicles": "Delta (rocket family)",
        "Sports": "Delta (horse), a famous Australian racehorse"
    },
    "depth": {
        "Query": "What is the depth of a well?",
        "Science and mathematics": "Depth in a well refers to the measurement between two points in an oil well, typically measured in feet or meters.",
        "Geology": "In geology, the depth of a well refers to the distance from the surface to the bottom of the well, which is important for understanding the geological formations and structures.",
        "Civil Engineering": "In civil engineering, the depth of a well refers to the vertical distance from the ground surface to the water table, which is crucial for determining the availability of groundwater.",
        "Environmental Science": "In environmental science, the depth of a well is the measurement from the ground surface to the depth at which groundwater is sampled for analysis, providing insights into water quality and contamination.",
        "Oil and Gas Industry": "In the oil and gas industry, the depth of a well refers to the vertical distance from the drilling rig to the target reservoir, which helps in determining the drilling strategy and estimating the cost of extraction.",
        "Mining": "In mining, the depth of a well refers to the vertical distance from the surface to the bottom of a mine shaft, which is important for understanding the depth of the ore body and planning mining operations.",
        "Archaeology": "In archaeology, the depth of a well refers to the vertical distance from the ground surface to the bottom of a well structure, providing insights into ancient water management systems and human settlements.",
        "Construction": "In construction, the depth of a well refers to the vertical distance from the ground surface to the bottom of a foundation or excavation, which is crucial for ensuring structural stability and preventing soil collapse."
    },
    "development": {
        "Query": "What are the stages of software development?",
        "Arts": "Development (music), the process thematic material is reshaped",
        "Business": "New product development",
        "Biology and medicine": "Embryogenesis, or development, the process by which the embryo is formed",
        "Computing": "Software development, the development of a software product",
        "Social science": "Economic development, the process by which a nation improves the economic, political, and social well-being of its people"
    },
    "dial": {
        "Query": "What is the function of a dial in a camera?",
        "Mechanical device": "A dial in a camera is used to adjust the exposure settings such as aperture, shutter speed, and ISO.",
        "DIAL": "In the context of a camera, DIAL stands for Digital Impact Alliance, which is not directly related to the function of a dial in a camera."
    },
    "domain": {
        "Query": "What is the domain of a function?",
        "Mathematics": "In mathematics, the domain of a function is the set of input values for which the function is defined. It represents the possible values that can be input into the function to produce an output.",
        "Information Technology": "In information technology, 'domain' is also used in the context of administrative domain, broadcast domain, collision domain, domain name, and application domain.",
        "Law and Human Geography": "In law and human geography, the term 'domain' does not specifically refer to the domain of a function. It is used in various other contexts such as demesne, eminent domain, private domain, public domain, and territory subdivision.",
        "Science": "In science, the term 'domain' is used in various contexts such as biology (taxonomic subdivision, protein domain), physics (magnetic domain, high-field domain), and sociology (social domain).",
        "Places": "In the context of places, 'domain' refers to specific locations such as shopping malls (The Domain in Austin, Texas and Hong Kong), hamlets (Domain, Manitoba), and public domains in Australia and New Zealand.",
        "Entertainment": "In the entertainment industry, 'domain' is used in the context of films and music. There are films titled 'Domain' in different languages and a song called 'Domain' by KSI."
    },
    "dot": {
        "Query": "What are the different meanings of the word 'dot'?",
        "Orthography": "In orthography, 'dot' can refer to a full stop or period, a diacritic mark above or below a character, or an interpunct punctuation mark.",
        "Mathematics": "In mathematics, 'dot' can refer to a decimal point, a dot operator used for multiplication, or a dot product operation.",
        "Arts and entertainment": "In arts and entertainment, 'dot' can refer to a work of art, a song, a book, a computer, a film, a restaurant, or a television station.",
        "Government agencies": "In government agencies, 'dot' can refer to various departments of transportation in different countries.",
        "Companies": "In companies, 'dot' can refer to a motorcycle manufacturing company, a foodservice redistribution company, or a record company.",
        "Technology": "In technology, 'dot' can refer to an element in Morse code, a Unix command, a graph description language, the DNS root zone, or a smart speaker developed by Amazon.",
        "Places": "In places, 'dot' can refer to an unincorporated community, a ghost town, a lake, or various geographical features in Antarctica or Boston.",
        "People, fictional characters, and mascots": "In people, fictional characters, and mascots, 'dot' can refer to a given name, a rose breeder, a dwarf performer, or a mascot of PBS Kids."
    },
    "draft": {
        "Query": "What is the draft of a ship?",
        "Watercraft dimensions": "Draft (hull), the distance from waterline to keel of a vessel",
        "Selection processes": "",
        "Entertainment": "",
        "Heating, cooling, air flow": "",
        "Finance": "",
        "Other uses": ""
    },
    "drift": {
        "Query": "What is the drift in geology?",
        "Geography": "Drift in geology refers to the deposited material of glacial origin, such as rocks, sediments, and debris, that is left behind by a moving glacier.",
        "Science, technology, and physics": "Drift in geology is the term used to describe the horizontal passage or adit in mining, which is a roughly horizontal tunnel used for accessing mineral deposits.",
        "Film and television": "In the context of film and television, drift does not have a specific meaning related to geology."
    },
    "elasticity": {
        "Query": "What is the definition of elasticity?",
        "Physics": "Elasticity in physics refers to the property of a material to deform reversibly under stress.",
        "Information Technology": "Elasticity in information technology can refer to the flexibility of a data store's data model and clustering, as well as the ability of a distributed system to dynamically allocate and deallocate system resources.",
        "Economics": "Elasticity in economics is a general term for a ratio of change and can have various specific forms such as price elasticity of demand, income elasticity of demand, and cross elasticity of demand.",
        "Finance": "In finance, elasticity can refer to different concepts such as price elasticity of demand, price elasticity of supply, elasticity of substitution, Frisch elasticity of labor supply, and yield elasticity of bond value.",
        "Mathematics": "Elasticity of a function in mathematics is a measure of point elasticity, which defines how a function changes with respect to a small change in its input variable.",
        "Other": "There may be other fields where the term 'elasticity' is used, but without specifying the field, it is difficult to provide a specific answer."
    },
    "element": {
        "Query": "What are the different meanings of the word 'element'?",
        "Science": "In science, 'element' refers to a pure substance of one type of atom, such as oxygen or gold.",
        "Mathematics": "In mathematics, 'element' is used to describe one of the constituents of a set or an entry in a matrix.",
        "Philosophy and religion": "In philosophy and religion, 'element' can refer to ancient beliefs about the fundamental types of matter, such as earth, air, fire, and water.",
        "Technology": "In technology, 'element' can represent various things, such as a part of a circuit, an HTML element in web development, or a component in software applications like Adobe Photoshop Elements.",
        "Business": "In the business context, 'element' can be associated with brands like Element by Westin or Element Electronics, or it can refer to a restaurant or shopping mall with the name 'Elements'.",
        "Entertainment": "In the entertainment industry, 'element' can be related to music, albums, songs, animation studios, miniseries, or esports teams.",
        "Other": "In other contexts, 'element' can be used in sports or as a general term without a specific field."
    },
    "emission": {
        "Query": "What are the different types of emissions and their impacts on the environment?",
        "Chemical products": "Emission of air pollutants, such as flue gas and exhaust gas, can have detrimental effects on air quality and contribute to climate change.",
        "Electromagnetic radiation": "Emission of electromagnetic radiation, including thermal emission and emission lines, is important in understanding the behavior of light and its interaction with matter.",
        "Environmental science": "Emission of greenhouse gases, such as carbon dioxide, methane, and nitrous oxide, is a major contributor to global warming and climate change.",
        "Physics": "Emission theory (relativity) is a competing theory for the special theory of relativity, which challenges the concept of light as an emission from a source.",
        "Vision science": "Emission theory (vision) proposes that visual perception is accomplished by rays of light emitted by the eyes, which is a controversial idea in the field of vision science."
    },
    "ensemble": {
        "Query": "What is the role of an ensemble in musical theatre?",
        "Art": "In musical theatre, an ensemble refers to a group of performers who sing and dance together as a chorus. They often play supporting roles and provide background vocals and movement in large-scale musical numbers.",
        "Mathematics and science": "In mathematics and science, an ensemble is a term used in statistical mechanics to describe a collection of identical or similar systems that are studied together to understand their collective behavior.",
        "Technology": "In technology, an ensemble can refer to a group of software components or tools that work together to perform a specific task or function. For example, the Geoworks Ensemble is a computer operating system that integrates various applications and utilities.",
        "Companies and organizations": "In the context of companies and organizations, an ensemble can refer to a theater company like the Ensemble Theatre in Houston, Texas, which brings together a group of actors, directors, and designers to produce theatrical performances."
    },
    "feature": {
        "Query": "What are the different meanings of the word 'feature'?",
        "Computing": "In computing, 'feature' can refer to feature recognition, which could be a hole, pocket, or notch. It can also refer to feature in computer vision, which could be an edge, corner, or blob. Additionally, it can refer to a feature in software design, which is an intentional distinguishing characteristic of a software item.",
        "Science and Analysis": "In science and analysis, 'feature' can refer to feature data in geographic information systems, which comprise information about an entity with a geographic location. It can also refer to features in audio signal processing, which aim to capture specific aspects of audio signals in a numeric way. Furthermore, it can refer to a feature in archaeology, which is any dug, built, or dumped evidence of human activity.",
        "Media": "In media, 'feature' can refer to a feature film, which is a film with a running time long enough to be considered the principal or sole film to fill a program. It can also refer to feature length, which is the standardized length of such films. Additionally, it can refer to a feature story, which is a piece of non-fiction writing about news. Moreover, it can refer to a radio documentary (feature), which is a radio program devoted to covering a particular topic in some depth, usually with a mixture of commentary and sound pictures. Lastly, it can refer to a feature as a guest appearance.",
        "Music": "In music, 'feature' can refer to a British punk trio called Feature (band). It can also refer to an American rock band called The Features.",
        "Linguistics": "In linguistics, 'feature' can refer to a property of a class of linguistic items which describes individual members of that class. It can also refer to a distinctive feature, which is the most basic unit of structure that can be analyzed by phonetics and phonology.",
        "Other Uses": "In other uses, 'feature' can refer to a film collaboration between filmmakers Michel Auder and Andrew Neel called The Feature. It can also refer to a standalone website called The Feature (originally named Give Me Something to Read), which features a few high-quality, long-form, nonfiction articles every day from Instapaper's most frequently saved articles."
    },
    "field": {
        "Query": "What are the different types of fields in mathematics?",
        "Algebra": "In algebra, a field is a type of algebraic structure that consists of a set of elements along with two binary operations, addition and multiplication, which satisfy certain axioms.",
        "Number Theory": "In number theory, a number field is a finite extension of the field of rational numbers, and it is used to study properties of numbers and their relationships.",
        "Geometry": "In geometry, a scalar field is a function that assigns a scalar value to each point in a mathematical space, and it is used to represent quantities such as temperature or pressure.",
        "Topology": "In topology, a vector field is a continuous assignment of a vector to each point in a mathematical space, and it is used to study properties of vector spaces and their transformations.",
        "Analysis": "In analysis, a tensor field is a function that assigns a tensor to each point in a mathematical space, and it is used to study properties of tensors and their derivatives.",
        "Set Theory": "In set theory, a field of sets is a mathematical structure that consists of a set of sets, and it is used to study properties of sets and their relationships.",
        "Logic": "In logic, a field of a binary relation is the union of its domain and its range, and it is used to study properties of relations and their compositions."
    },
    "file": {
        "Query": "What are the different meanings of the word 'file'?",
        "Mechanical tools and processes": "A file is a tool used to remove fine amounts of material from a workpiece. It is also a material removal process in manufacturing.",
        "Documents": "A file can refer to an arranged collection of documents. It is also the act of submitting a document to the clerk of a court.",
        "Computing": "In computing, a file is a resource for storing information. It can also refer to a Unix program for determining the type of data contained in a computer file.",
        "Other uses": "In other contexts, a file can refer to a single column of troops one in front of the other. It can also be a column of the chessboard or a culinary ingredient used in Cajun and Creole cooking."
    },
    "filter": {
        "Query": "What are the different types of filters used in signal processing?",
        "Science and technology": "Filter (signal processing) is a technique used in signal processing to modify or enhance certain aspects of a signal. It can be implemented using electronic circuits, such as electronic filters, or through mathematical operations in digital filters.",
        "Device": "Electronic filters are commonly used in signal processing to remove unwanted frequency components from a signal. They can be analog filters, which are basic building blocks of signal processing in electronics, or digital filters, which perform mathematical operations on the signal.",
        "Mathematics": "In mathematics, a filter is a special subset of a partially ordered set. It can also refer to a special family of subsets that forms a filter with respect to set inclusion. Filters are used in topology to describe convergence and in stochastic processes to model filtering problems.",
        "Optics": "Optical filters are used in signal processing to selectively transmit or reflect light of different wavelengths. They can be interference filters, dichroic filters, hydrogen-alpha filters, photographic filters, infrared cut-off filters, Chelsea filters, or astronomical filters.",
        "Signal processing": "Filters are essential in signal processing to modify or enhance signals. They can be electronic filters, which are electronic circuits that process signals, or digital filters, which perform mathematical operations on signals. Analog filters are commonly used in signal processing.",
        "Arts and entertainment": "Filter is the name of an American rock band. They have released several albums and songs, including the song 'Filter' from the album Bend by 8stops7. Filter is also the name of a TV series on the G4 channel and an indie music magazine."
    },
    "flow": {
        "Query": "What are the different types of flow in science and technology?",
        "Science and technology": "In science and technology, flow can refer to fluid flow, which is the motion of a gas or liquid. It can also refer to flow in geomorphology, which is a type of mass wasting or slope movement. Additionally, flow can be a group action of the real numbers on a set in mathematics. In psychology, flow is a mental state of being fully immersed and focused. Finally, flow can be a spacecraft of NASA's GRAIL program.",
        "Computing": "In computing, flow can refer to a flow network, which is a graph-theoretic version of a mathematical flow. It can also refer to flow analysis, which is a concept in computer systems. There are also various software and programming languages named 'Flow' such as Microsoft Flow (now Power Automate), Neos Flow, webMethods Flow, and FLOW (an educational programming language from the 1970s). Flow is also the name of a web browser with a proprietary rendering engine.",
        "Arts, entertainment and media": "In arts, entertainment, and media, flow can refer to a journal called 'Flow' that focuses on television and media studies. It can also refer to a non-fiction book titled 'The Flow' by Amy-Jane Beer. Flow is also the name of a video game and a fictional character in the International Ultramarine Corps comics. In addition, Flow 93.5 is a Canadian radio station, and Flow FM is an Australian radio station. Flow is also the name of a cable television operator in Argentina.",
        "Film and television": "In film and television, flow can refer to the sequencing of TV material from one element to the next. Flow TV is a network of Ripe Digital Entertainment. 'Flow: For Love of Water' is a documentary film released in 2008. There are also films titled 'Flow' released in 1996 and 2014.",
        "Music": "In music, flow can refer to the rhythms and rhymes of a hip-hop song's lyrics and how they interact. Flow is also the name of an American new age band, a Japanese rock group, and a rapper named Flow G. There are also albums titled 'Flow' by Terence Blanchard, Conception, Foetus, and Chris Leslie. Additionally, there are songs titled 'Flow' by Cage the Elephant, Cloud Wan, Sade, and Transister.",
        "Other uses": "In other uses, flow can refer to a Caribbean telecommunications provider called Flow. It can also refer to a form of note-taking in policy debate and public forum debate called flow. Flow is the name of an American residential real estate company. FLOW is a national health care network in Belgium. Finally, Flow is the name of an Indian football league called Football League of West Godavari."
    },
    "focus": {
        "Query": "What are the different meanings of the word 'focus'?",
        "Arts": "Focus or Focus Festival, former name of the Adelaide Fringe arts festival in East Australia.",
        "Film": "Focus, a 1962 TV film starring James Whitmore",
        "Music": "Focus (music), a musical technique also known as modal frame",
        "Albums": "Focus (Stan Getz album), 1961 jazz album",
        "Songs": "\"Focus\" (Ariana Grande song), 2015",
        "Writing": "Focus (encyclopedia), a 1958 Swedish language encyclopedia",
        "Companies, brands, organizations": "Focus DIY, a UK chain of do-it-yourself stores",
        "Science and technology": "Focus (computing), which of a number of GUI elements currently accepts keyboard input",
        "Social sciences": "Focus or attention, selectively concentrating on one aspect of the environment while ignoring other things",
        "Other sciences": "Focus (earthquake), an earthquake's underground point of origin or hypocenter",
        "Military technology": "AGM-87 Focus, a U.S. Navy air-to-surface missile"
    },
    "frame": {
        "Query": "What are the different types of frames used in construction?",
        "Physical objects": "In building construction, frames can refer to light frame construction, timber framing, space frames, and A-frame structures.",
        "Vehicles": "In the context of vehicles, frames can refer to aircraft fuselage frames, boat frames, bicycle frames, motorcycle frames, locomotive frames, and vehicle frames.",
        "Other physical objects": "Frames can also be found in loudspeakers, bed frames, climbing frames, eyeglass frames, lever frames, picture frames, firearm frames, spinning frames, water frames, and beehive frames.",
        "Mathematics and physics": "In mathematics and physics, frames can refer to ordered bases, frame bundles, linear algebra frames, frames and locales in order theory, k-frames, moving frames, orthonormal frames, projective frames, sampling frames, and frames of reference.",
        "Computing and telecommunications": "In the field of computing and telecommunications, frames can be GUI frames, film frames, photographic film frames, frame rates, web frames, or iframe elements.",
        "Software": "Specific software related to frames includes Adobe FrameMaker, Google Chrome Frame, and software frameworks.",
        "Other uses in computing and telecommunications": "Frames can also be used in artificial intelligence, networking, distribution frames, mainframe computers, page frames, stack frames, frame languages, frame problems, frame technology, and frame synchronization.",
        "Other sciences": "In other sciences, frames can be related to physics and probability models, animal experimentation, horse coat patterns, hive frames, reading frames in nucleotide sequences, frameshift mutations, frame analysis in social sciences, FRAMES methods for alcohol misuse, and framing in communication theory and sociology.",
        "Arts and media": "In the arts and media, frames can refer to specific episodes of TV series, films, production companies, frame stories in literature, literary journals, design magazines, and poetry books.",
        "Music": "Frames can also be the name of a band or album titles in the music industry.",
        "Visual arts": "In visual arts, frames can refer to specific paintings, such as 'The Frame' by Frida Kahlo."
    },
    "fusion": {
        "Query": "What are the different types of fusion reactions in nuclear physics?",
        "Science and technology": "In nuclear physics, fusion refers to the process of multiple atomic nuclei combining to form one or more different atomic nuclei and subatomic particles. There are several types of fusion reactions, including nuclear fusion, cold fusion, and heat fusion.",
        "Biology and medicine": "In biology and medicine, fusion refers to the process in which several uninuclear cells combine to form a multinuclear cell. It can also refer to gene fusion, a genetic event and molecular biology technique.",
        "Computing": "In computing, fusion can refer to image fusion, a process of combining relevant information from two or more images into a single image. It can also refer to sensor fusion, which involves combining sensory data from disparate sources.",
        "Application software": "In the context of application software, Fusion 360 is a 3D CAD, CAM, and CAE program by Autodesk. It is used for designing and engineering purposes.",
        "Middleware and operating system components": "In the field of middleware and operating system components, Fusion can refer to Oracle Fusion Middleware, a portfolio of standards-based software products that spans multiple services.",
        "Arts and media": "In the arts and media, Fusion can refer to Fusion Magazine, an American music magazine that was published from 1967 to 1974.",
        "Film and television": "In film and television, Fusion can refer to the first-season episode of Star Trek: Enterprise titled 'Fusion'. It can also refer to Fusion, an American cable and satellite news channel.",
        "Gaming": "In the gaming industry, Fusion can refer to Metroid Fusion, a 2002 Game Boy Advance game.",
        "Magazines": "In the context of magazines, Fusion can refer to Fusion (music magazine), an American music magazine that was published from 1967 to 1974.",
        "Music and dance": "In the field of music and dance, Fusion can refer to jazz fusion, a genre that combines rock and jazz.",
        "Businesses and organizations": "In the context of businesses and organizations, Fusion can refer to Fusion Energy Foundation, a defunct American non-profit think tank co-founded by Lyndon LaRouche in 1974.",
        "Sports teams": "In the realm of sports teams, Fusion can refer to Philadelphia Fusion, an American esports team.",
        "Other organizations": "In the context of other organizations, Fusion can refer to Fusion Media Group, a division of Univision Communications.",
        "Law and politics": "In law and politics, Fusion can refer to fusion of powers, a feature of some parliamentary forms of government.",
        "Products": "In terms of products, Fusion can refer to Ford Fusion (Americas), a mid-sized car produced by Ford Motor Company."
    },
    "graph": {
        "Query": "What are the different types of graphs in mathematics?",
        "Mathematics": "In mathematics, there are several types of graphs. Some common types include: directed graphs, undirected graphs, weighted graphs, bipartite graphs, complete graphs, and tree graphs.",
        "Computing": "In computing, graphs can refer to abstract data types representing relations or connections. They can also be used to visualize data structures and algorithms, such as graph databases or graph algorithms.",
        "Physics": "In physics, graphs can represent various physical phenomena. For example, position-time graphs can represent the motion of an object, while energy-level graphs can represent the energy states of a system.",
        "Social Sciences": "In social sciences, graphs can be used to analyze and visualize social networks. They can represent relationships between individuals, groups, or organizations, and help understand patterns of interaction and influence.",
        "Economics": "In economics, graphs are commonly used to represent supply and demand curves, production possibilities frontiers, and other economic relationships. They provide a visual representation of economic concepts and help analyze market behavior.",
        "Biology": "In biology, graphs can represent various biological processes and relationships. For example, phylogenetic trees represent evolutionary relationships between species, while gene expression graphs show the expression levels of genes over time or under different conditions."
    },
    "grid": {
        "Query": "What is the grid?",
        "Arts and entertainment": "The grid is the virtual environment of the game Second Life.",
        "Video games": "The Grid is a series of racing video games developed by Codemasters.",
        "Music": "The Grid is a 1990s electronic dance group from London.",
        "Television": "The Grid is a BBC drama from 2004.",
        "Place names": "Grid is a village administered by Călan town, Hunedoara County, Romania.",
        "Space partitioning": "Grid (spatial index) is a discretization of a geometric domain into a set of contiguous cells, used to organize information.",
        "Other uses": "GRID (geometry) refers to the Great Rhomb-Icosi-Dodecahedron or truncated icosidodecahedron."
    },
    "horn": {
        "Query": "What are the different types of horns in animals?",
        "Biology": "In biology, horns are pointed, bony projections on the head of various animals. They can be found in species such as rhinoceros, antelope, and goats.",
        "Music": "In music, the horn refers to a family of musical instruments, including the French horn. It is a brass instrument with a characteristic curved shape and is commonly used in orchestras and bands.",
        "Transportation": "In transportation, horns are devices used in vehicles to produce sound signals. They are commonly found in cars, trains, and ships to alert others of their presence or to indicate warnings.",
        "Geography": "In geography, Horn is a district in Austria, a municipality in Germany, and a town in England. These places are named after the geographical feature or have historical significance associated with the term 'horn'.",
        "Entertainment": "In entertainment, 'Horn' is the title of an album by Apink released in 2022 and a video game released in 2012. It can also refer to songs or tracks with 'horn' in their titles, such as 'The Horn' by Super Furry Animals and 'The Horn' by Derek and Clive Ad Nauseam."
    },
    "hull": {
        "Query": "What are the different types of hulls in shipbuilding?",
        "Structures": "In shipbuilding, there are several types of hulls used, such as monohull, catamaran hull, trimaran hull, semi-displacement hull, and planing hull.",
        "Mathematics": "In mathematics, the term 'hull' can refer to the convex hull, which is the smallest convex set that contains a given set of points.",
        "Places": "In the context of shipbuilding, the term 'hull' can refer to the city of Hull in the United Kingdom, which has a rich maritime history and is home to the Port of Hull.",
        "Canada": "In Canada, 'Hull' can refer to the former city of Hull, which is now part of the city of Gatineau in Quebec.",
        "United States": "In the United States, there are several towns and cities named 'Hull', such as Hull, Massachusetts and Hull, Georgia.",
        "Other places": "In Nové Zámky District, Slovakia, there is a village called Hul, which is pronounced similarly to 'hull'.",
        "People": "There are several individuals with the surname 'Hull', but their relevance to shipbuilding may vary."
    },
    "identity": {
        "Query": "What is the concept of identity?",
        "Philosophy": "In philosophy, identity refers to the relation each thing bears only to itself. It explores questions about the nature of personal identity and the self.",
        "Social Science": "In social science, identity refers to the qualities, characteristics, and beliefs that characterize a person or a group. It includes aspects such as cultural identity, gender identity, and national identity.",
        "Mathematics": "In mathematics, identity refers to an equality that holds regardless of the values of its variables. It can also refer to the identity element, which is an element of a set that leaves every other element unchanged when a specific operation is applied.",
        "Arts and Entertainment": "In arts and entertainment, identity can be explored through various mediums such as films, TV shows, and music. It can be depicted in narratives that delve into personal or social identity themes.",
        "Business": "In business, identity can refer to brand identity, which is the expression of a brand and how it presents itself to the public. It can also encompass corporate identity, which encompasses the overall image and perception of a corporation.",
        "Science": "In science, identity can have different meanings depending on the field. For example, in computer science, digital identity refers to the information used by computer systems to represent an external agent. In object-oriented programming, identity refers to the property of objects that distinguishes them from other objects.",
        "Publications": "In publications, identity can refer to the title of a novel or a magazine. For example, 'Identity' is a novel written by Milan Kundera, published in 1998. It can also be the name of a defunct quarterly Australian magazine published by the Aboriginal Publications Foundation from 1971 to 1982.",
        "Music": "In music, identity can be explored through albums, songs, and musical theories. For example, 'Identity' is the title of albums by various artists such as 3T, BoA, and Far East Movement. It can also refer to the concept of identity in post-tonal music theory.",
        "Other Uses": "In other contexts, identity can refer to an identity document or ID, which is an official document used to prove a person's identity. It can also be used in the context of an accounting identity, which is a calculation that must be true regardless of its variables."
    },
    "kernel": {
        "Query": "What is the kernel?",
        "Computing": "The kernel is the central component of most operating systems, responsible for managing the system's resources and providing a bridge between software and hardware.",
        "Mathematics": "In linear algebra, the kernel of a linear transformation is the set of vectors that map to the zero vector. It represents the null space of the transformation.",
        "Functions": "In statistics, a kernel is a weighting function used in kernel density estimation to estimate the probability density function of a random variable.",
        "Science": "In botany, a kernel refers to the seed inside the nut or fruitstone of plants. For example, the kernel of a corn is the edible part of the seed.",
        "Companies": "Kernel is the name of a Ukrainian agriculture company that specializes in producing sunflower oil."
    },
    "key": {
        "Query": "What are the different meanings of the word 'key'?",
        "Common uses": "Key (cryptography), a piece of information needed to encode or decode a message",
        "Music": "Key (Meredith Monk album), 1971",
        "Places": "Cay, also spelled key, a small, low-elevation, sandy island formed on the surface of a coral reef",
        "United States": "Key, Alabama",
        "Elsewhere": "Key, Iran, a village in Isfahan Province, Iran",
        "Arts, entertainment and media": "The Key (1934 film), a 1934 film directed by Michael Curtiz",
        "Literature": "The Key (Curley novel), a 2005 novel by Marianne Curley",
        "Songs": "\"The Key\" (Speech Debelle song), 2009",
        "Television": "\"The Key\" (Code Lyoko episode), 2005",
        "Other uses in arts, entertainment and media": "Key (character), a supervillain in the DC Comics universe",
        "People": "Key (entertainer) (born 1991), South Korean entertainer",
        "Sports": "Key (basketball), a restricted area around the basketball net",
        "Technology": "Key (computing), a field in a computer file or database used to sort or retrieve records"
    },
    "layer": {
        "Query": "What is the function of a layer in the OSI model?",
        "Technology": "In the OSI model, a layer is a conceptual division of functionality that defines a specific set of protocols and services. Each layer performs a specific function and interacts with the layers above and below it to facilitate communication between network devices.",
        "Science": "In the neocortex, a layer refers to an area with specific structure and connection pattern among neurons. These layers play a crucial role in information processing and integration in the brain.",
        "Electronics": "In electronics, a layer refers to a single thickness of some material covering a surface. It can be a conductive layer, insulating layer, or protective layer, depending on the specific application.",
        "Arts, entertainment, and media": "In the arts and media, 'Layers' can refer to various albums, songs, or films with the word 'layers' in their titles, such as the albums by Kungs, Les McCann, and Royce da 5'9', or the Russian film 'Layer'."
    },
    "left": {
        "Query": "What are the different meanings of the word 'left'?",
        "Music": "In the field of music, 'left' can refer to albums such as 'Left' by Hope of the States, 'Left' by Monkey House, and 'Left' by Helmet. It can also refer to the song 'Left' by Nickelback from their album 'Curb'.",
        "Direction": "In terms of direction, 'left' refers to the relative direction opposite of right. It is the direction you turn when you move your body to the left side.",
        "Handedness": "In the context of handedness, 'left' refers to left-handedness. It is the preference or tendency to use the left hand more dominantly for tasks.",
        "Politics": "In politics, 'left' is often used to describe the liberal or progressive side of the political spectrum. It represents ideologies that advocate for social equality and government intervention.",
        "Sports": "In sports, 'left' can refer to the left side of the field or court. It is often used to describe positions or movements that involve the left side, such as a left winger in soccer or a left-handed shot in basketball."
    },
    "line": {
        "Query": "What are the different meanings of the word 'line'?",
        "Geometry": "In geometry, a line is an object that has zero thickness and curvature and stretches to infinity.",
        "Arts, entertainment, and media": "In arts, entertainment, and media, 'line' can refer to films, podcasts, literature, music, television shows, and other forms of artistic expression.",
        "Business": "In business, 'line' can refer to terms such as 'bottom line', 'line item', 'line of business', and 'product lining'.",
        "Computing and telecommunications": "In computing and telecommunications, 'line' can refer to electrical circuits, audio signals, text files, video display resolution, software applications, and technology companies.",
        "Military": "In the military, 'line' can refer to tactical formations, fortifications, naval warfare, and naval officers.",
        "People": "In relation to people, 'line' can refer to given names, surnames, and specific families.",
        "Places": "In terms of places, 'line' can refer to municipalities, islands, planned cities, sculpture trails, and geological features.",
        "Science": "In the field of science, 'line' can refer to geological faults, genetic lineages, DNA sequences, and units of measurement.",
        "Sports": "In sports, 'line' can refer to ligatures, fishing lines, kite lines, ice hockey lines, cricket delivery, and racing lines.",
        "Transport": "In the context of transport, 'line' can refer to airlines, nautical ropes, shipping companies, railway routes, and waterlines."
    },
    "link": {
        "Query": "What are the different meanings of the word 'link'?",
        "Places": "Link, West Virginia is an unincorporated community in the US.",
        "People with the name": "Link (singer) is an American R&B singer.",
        "Devices": "Link is a single element of a chain.",
        "Science and technology": "In computing, a link is a hyperlink from one electronic document to another.",
        "Data networks": "Link (Indonesia) is an interbank network.",
        "Mathematics": "In knot theory, a link is a collection of knots entangled with one another.",
        "Other uses in science and technology": "Link (Mars) is a rock outcrop.",
        "Arts, entertainment, and media": "Link (The Legend of Zelda) is a fictional character in The Legend of Zelda media.",
        "Games": "Links is a computer-simulated golf game by Access Software.",
        "Music": "Link is a song by L'Arc-en-Ciel.",
        "Periodicals": "Link (magazine) is a free publication of The Greenville News in Greenville, South Carolina, US.",
        "Television": "Link TV is a US network.",
        "Other uses in arts, entertainment, and media": "Link is a 1986 horror movie featuring a super-intelligent, murderous orangutan.",
        "Organizations and programs": "Link REIT is a Hong Kong real estate investment trust.",
        "Other organizations and programs": "HOL LiNK program is a literacy and numeracy knowledge program by Hands On Learning Australia.",
        "Transportation systems": "Link bus rapid transit is a planned line in Rochester, Minnesota, US."
    },
    "localization": {
        "Query": "What is localization?",
        "Biology": "Localization of function refers to the process of locating psychological functions in the brain or nervous system.",
        "Engineering and technology": "Localization in the context of engineering and technology can refer to determining the location of a cell phone or wireless transceiver using GSM localization.",
        "Adaptation to language, etc.": "Language localization involves translating a product into different languages or adapting it to a specific country or region.",
        "Mathematics": "Localization of a ring and a module is a formal way to introduce the 'denominators' to a given ring or module in abstract algebra.",
        "Physics": "Anderson localization is the absence of diffusion of waves in a disordered medium in condensed matter physics."
    },
    "mark": {
        "Query": "What is the significance of the Gospel of Mark in the New Testament?",
        "Bible-New Testament": "The Gospel of Mark is one of the four canonical gospels and is traditionally ascribed to Mark the Evangelist. It is believed to be the earliest written account of the life, ministry, death, and resurrection of Jesus Christ.",
        "Currency": "N/A",
        "German": "N/A",
        "People": "N/A",
        "Places": "N/A",
        "Europe": "N/A",
        "United States": "N/A",
        "Sports": "N/A"
    },
    "market": {
        "Query": "What are the different types of markets?",
        "Economics": "In economics, markets can be classified into various types such as market economy, agricultural market, financial market, stock market, etc.",
        "Art, Entertainment, and Media": "In the context of art, entertainment, and media, markets can refer to films, TV series, and other forms of media distribution.",
        "Brands or Enterprises": "In the business world, markets can be associated with specific brands or enterprises, such as The Market (company) or specialized stores like Safeway's The Market.",
        "Types of Physical Markets": "Physical markets include bazaars, farmers' markets, fish markets, flea markets, grocery stores, market squares, night markets, and more.",
        "Aspects of Economic Markets": "Aspects of economic markets encompass concepts like market research, market segmentation, market value, market share, market trend, and more.",
        "Types of Economic Markets": "Economic markets can be classified into various types such as emerging markets, energy markets, foreign exchange markets, real estate markets, etc."
    },
    "master": {
        "Query": "What are the different meanings of the word 'master'?",
        "Ranks or titles": "Master (college), head of a college",
        "Aircraft and vehicles": "Alenia Aermacchi M-346 Master, an Italian military transonic trainer aircraft",
        "Arts, entertainment, and media": "Master (Manos), the head villain in the horror movie Manos: The Hands of Fate",
        "Films": "Master (1997 film), an Indian Telugu-language film",
        "Literature": "The Master (novel), a 2004 novel by Colm Tóibín",
        "Music and audio": "Mastering (audio), a process resulting in a master recording, also known as a master, master copy, or master tape",
        "Television and film": "The Master (U.S. TV series), a 1984 American television series starring Lee Van Cleef that aired on NBC",
        "People": "Masami Hirosaka (born 1966), known as Master Masami, Japanese radio-controlled racer",
        "Places": "Master, Iran, a village in Markazi Province, Iran",
        "Schools": "Master's Academy & College, Canadian school in Calgary, Alberta",
        "Sport": "Golf: Masters Tournament, known as The Masters, one of the four men's major championships",
        "Tennis": "ATP World Tour Finals, the season-ending tournament on the ATP tour known in the past as The Masters (derived from 'Masters Grand Prix' and subsequently 'Tennis Masters Cup')",
        "Other sports": "Senior sport, a competition age classification used by many sports for older athletes",
        "Other uses": "MASTER, a Russian network of telescopes"
    },
    "matrix": {
        "Query": "What is the matrix?",
        "Mathematics": "In mathematics, a matrix is a rectangular array of numbers, symbols, or expressions.",
        "Film and Television": "In the film and television industry, 'The Matrix' refers to a 1999 science fiction action film.",
        "Technology": "In technology, a matrix can refer to a two-dimensional grid of intersecting diodes, such as a diode matrix.",
        "Arts and Entertainment": "In arts and entertainment, 'Matrix' can refer to a character from the Canadian animated TV series ReBoot.",
        "Music": "In music, 'Matrix' can refer to an American jazz-fusion ensemble.",
        "Businesses and Organizations": "In businesses and organizations, 'Matrix' can refer to Matrix Business Technologies, an American telecommunications firm.",
        "People": "In reference to people, 'Matrix' can refer to Marco Materazzi, an Italian footballer nicknamed 'Matrix'.",
        "Transportation": "In transportation, 'Matrix' can refer to the Hyundai Matrix, a multi-purpose road vehicle."
    },
    "medium": {
        "Query": "What is the medium?",
        "Science and technology": "In the context of science and technology, medium refers to the material substance through which waves or energy can propagate, such as air, water, or glass.",
        "Aviation": "In aviation, medium can refer to a class of warplane known as a medium bomber.",
        "Communication": "In the field of communication, medium can refer to tools used to store and deliver information or data, such as newspapers, television, or the internet.",
        "Wave physics": "In wave physics, medium can refer to any material substance that can propagate waves or energy, such as a transmission medium or an optical medium.",
        "Other uses in science and technology": "In various other scientific and technological contexts, medium can refer to different things, such as a data storage medium, a growth medium for microorganisms, or a porous medium that allows fluid to pass through.",
        "Arts, entertainment, and media": "In the arts, entertainment, and media industry, medium can refer to different things, such as a film, a series of films, a publication, a television series, a publishing platform, or a record label.",
        "Periodicals": "In the context of periodicals, medium can refer to an entertainment weekly or a student newspaper.",
        "Other arts, entertainment, and media": "In other arts, entertainment, and media contexts, medium can refer to different things, such as art materials and techniques, a TV series, a video game, or a practitioner of mediumship.",
        "People": "In the context of people, medium can refer to a practitioner of mediumship, someone who claims to mediate communication between spirits of the dead and living human beings."
    },
    "mint": {
        "Query": "What are the different types of mint plants?",
        "Plants": "Mentha piperita (peppermint), Mentha spicata (spearmint), and Mentha arvensis (corn mint) are some common types of mint plants.",
        "Coins and collectibles": "Mint plants are not relevant in the context of coins and collectibles.",
        "Arts and entertainment": "Mint plants are not relevant in the context of arts and entertainment.",
        "Film and television": "Mint plants are not relevant in the context of film and television.",
        "Music": "Mint plants are not relevant in the context of music.",
        "Literature": "Mint plants are not relevant in the context of literature.",
        "Businesses, organisations and products": "Mint plants are not relevant in the context of businesses, organisations, and products.",
        "Computing": "Mint plants are not relevant in the context of computing.",
        "Places": "Mint plants are not relevant in the context of places."
    },
    "mode": {
        "Query": "What are the different meanings of the word 'mode'?",
        "Arts and entertainment": "Mode (magazine), a defunct U.S. women's fashion magazine",
        "Music": "Mode (music), a system of musical tonality involving a type of scale coupled with a set of characteristic melodic behaviors",
        "Computing": "Mode (user interface), distinct method of operation within a computer system, in which the same user input can produce different results depending on the state of the system",
        "Language": "Grammatical mood, also known as mode, a category of verbal inflections that expresses an attitude of mind",
        "Mathematics": "Mode (statistics), the most common value among a group",
        "Places": "Mode, Banmauk, a village in Burma",
        "Science": "Mode (electromagnetism)",
        "Other uses": "Amateur radio modes"
    },
    "mole": {
        "Query": "What are the different meanings of the word 'mole'?",
        "Animals": "Mole (animal) or 'true mole' refers to a small burrowing mammal found in various parts of the world, such as the golden mole in southern Africa and the marsupial mole in Australia.",
        "Other common meanings": "Nevus or melanocytic nevus is another term for a mole, which is a growth on human skin. Mole can also refer to a structure separating bodies of water in architecture, or a spy in an organization in the context of espionage. In Mexican cuisine, mole is a type of sauce.",
        "Arts and entertainment": "In the novel 'The Wind in the Willows' by Kenneth Grahame, Mole is a character. Mole is also a character in the Happy Tree Friends series. Additionally, Mole is a criminal in Dick Tracy comic strips. 'El Topo' is a film also known as 'The Mole'. 'De Mol' is a TV series. 'The Mole' is a song by Harry James.",
        "Science and technology": "Mole (unit) is the SI unit for the amount of substance. A tunnel boring machine is also referred to as a mole. The Heat Flow and Physical Properties Package is a burrowing probe sent to Mars.",
        "People": "Mole can be a surname, or it can refer to the French surname Molé.",
        "Places": "In Australia, there are locations such as Mole River (New South Wales) and Mole Creek (Tasmania). In England, there is River Mole in Surrey and River Mole in Devon. In France, there is La Môle, a commune in Var Département, and Le Môle, an Alp mountain. In Ghana, there is Mole National Park. In India, there is Mole, Karnataka, a village. In Myanmar, there is Mole, Shwegu, a village."
    },
    "nail": {
        "Query": "What are the different types of nails used in construction?",
        "Biology": "In biology, a nail refers to the toughened protective protein-keratin found at the end of an animal digit, such as a fingernail.",
        "Objects": "In the context of construction, a nail is a pin-shaped fastener used to join materials together.",
        "Arts and entertainment": "In the arts and entertainment industry, 'The Nail' refers to a three-issue comic book miniseries called JLA: The Nail.",
        "People": "In terms of people, 'Nail' can be a given name or a surname. There are lists of people with the given name Nail and the surname Nail or Nails.",
        "Businesses": "Nail Brewing is an Australian brewery, and Nails Inc. is an English nail care chain."
    },
    "needle": {
        "Query": "What are the different types of needles used in sewing?",
        "Crafting": "Sewing needle, a long slender tool with a pointed tip",
        "Science and technology": "No relevant information",
        "Medicine": "No relevant information",
        "Technology": "No relevant information",
        "People": "No relevant information",
        "Places": "No relevant information",
        "Arts and entertainment": "No relevant information"
    },
    "net": {
        "Query": "What is the net?",
        "Mathematics and Physics": "In mathematics and physics, a net is a filter-like topological generalization of a sequence.",
        "Polyhedron": "In the context of polyhedra, a net refers to an arrangement of polygons that can be folded up to form a polyhedron.",
        "Incidence Structure": "An incidence structure consisting of points and parallel classes of lines is also referred to as a net.",
        "Computational Geometry": "In computational geometry, a net is a mathematical concept whereby a general set is approximated by a collection of simpler subsets.",
        "Operator Algebras": "In the field of local quantum field theory, a net refers to operator algebras."
    },
    "network": {
        "Query": "What are the different types of networks?",
        "Science and technology": "In the field of science and technology, different types of networks include network theory, which studies graphs as a representation of relations between objects, and network science, an academic field that studies complex networks.",
        "Mathematics": "In mathematics, different types of networks include scale-free networks, which have a degree distribution that follows a power law, and small-world networks, which are mathematical graphs where most nodes are not neighbors but have neighbors in common.",
        "Biology": "In biology, different types of networks include biological networks, which apply to biological systems, ecological networks, which represent interacting species in an ecosystem, and neural networks, which are networks or circuits of neurons.",
        "Technology and communication": "In the field of technology and communication, different types of networks include artificial neural networks, which are computing systems inspired by animal brains, broadcast networks, which consist of radio stations, television stations, or other electronic media outlets that broadcast content from a centralized source, and telecommunications networks, which allow communication between separated nodes.",
        "Sociology and business": "In sociology and business, different types of networks include social networks, which are studied in social science research, scientific collaboration networks, which are social networks where nodes are scientists and links are co-authorships, and business networks, which involve the sharing of information or services between people, companies, or groups.",
        "Arts, entertainment, and media": "In the arts, entertainment, and media fields, different types of networks include the film 'Network' from 1976, the TV series 'Network,' and the album 'Network' by Saga."
    },
    "node": {
        "Query": "What is the definition of a node?",
        "Mathematics": "In mathematics, a node can refer to a vertex in a mathematical graph or a point where two or more curves, lines, or edges meet.",
        "Science and Engineering": "In science and engineering, a node can refer to the points where an orbit crosses a plane of reference in astronomy or the points where the orbits of the Sun and Moon intersect in lunar nodes.",
        "Biology": "In biology, a node can refer to various structures such as lymph nodes, nodes of Ranvier in myelinated axons, sinoatrial and atrioventricular nodes in the heart, or the place on a plant stem where a leaf is attached.",
        "Computing and Electronics": "In computing and electronics, a node can refer to a point of connection in a communication network, an entity in a mesh network, a region in an electrical circuit where there is no change in potential, a basic unit used to build data structures in computer science, or a computational device in the Unified Modeling Language (UML).",
        "Linguistics": "In linguistics, a node can refer to a branch point in the Tree model or Node Theory of language evolution.",
        "Physics": "In physics, a node can refer to a point along a standing wave where the wave has minimal amplitude.",
        "Space-station modules": "In the context of space-station modules, a node can refer to various modules of the International Space Station such as Node 1 (Unity), Node 2 (Harmony), Node 3 (Tranquility), Node 4 (proposed), or Prichal (planned).",
        "Music": "In music, a node can refer to an Italian death metal band called Node, a Danish singer and hip hop artist of Kurdish origin known as Node, or a 2015 album by the Australian metalcore band Northlane titled Node."
    },
    "norm": {
        "Query": "What is the norm?",
        "Academic Disciplines": "Normativity, phenomenon of designating things as good or bad",
        "Mathematics": "Norm (mathematics), a map that assigns a length or size to a mathematical object",
        "People": "Norm (given name)",
        "Arts and Entertainment": "Norm Peterson, a character in the sitcom Cheers and its spin-off Frasier"
    },
    "note": {
        "Query": "What are the different meanings of the word 'note'?",
        "Music and entertainment": "In music, a note refers to a pitched sound or a symbol for a sound. It can also refer to an album by Paul Bley and Paul Motian, a TV sitcom, a short film, or a journal of the Music Library Association.",
        "Finance": "In finance, a note can refer to a banknote or cash currency, a promissory note which is a contract binding one party to pay money to another party, or a type of bond.",
        "Technology and science": "In technology and science, note can refer to IBM Notes, a client-server application, natural orifice transluminal endoscopic surgery (NOTES), a type of minimally invasive surgery, a note-taking application by Apple, a Japanese video game company, a series of mobile phones, a computer programming tag, or Microsoft OneNote, a note-taking application bundled with Office.",
        "Writing, texts, and documents": "In writing, texts, and documents, note can refer to a diplomatic note or letter of protest, a commentary or reference appended to a text, a recording of information, a diplomatic letter or document, or a suicide note."
    },
    "object": {
        "Query": "What is the definition of object?",
        "Philosophy": "In philosophy, an object refers to a thing, being, or concept that exists.",
        "Computer Science": "In computer science, an object is a language mechanism for binding data with methods that operate on that data.",
        "Mathematics": "In mathematics, an object is an abstract entity arising in mathematical theories and categories.",
        "Physics": "In physics, an object is an identifiable collection of matter or a physical body.",
        "Arts": "In arts, an object can refer to a sculpture, prop, or album.",
        "Psychology": "In object relations theory of psychoanalysis, an object is what a subject relates to."
    },
    "organic": {
        "Query": "What is organic?",
        "Biology": "Organic refers to anything related to living organisms, such as organic matter or organic compounds.",
        "Chemistry": "Organic refers to compounds that contain carbon, or the study of organic compounds in organic chemistry.",
        "Farming": "Organic refers to agricultural practices that follow specific standards for fertilization and pest control, or organic products produced through these methods.",
        "Computing": "Organic can refer to a computer built from living neurons, computing systems with self-configuration and self-optimization properties, or search results through unpaid search engine listings.",
        "Economics": "Organic growth refers to business expansion through increasing output and sales, as opposed to mergers and acquisitions.",
        "Law": "Organic law refers to fundamental laws, or regulations for an organization or governmental body.",
        "Music": "Organic can refer to various albums in the music industry."
    },
    "pad": {
        "Query": "What are the different types of pads used in sports?",
        "Wearables": "Pads, protective equipment used in baseball, cricket, and hockey",
        "Computing and electronics": "Gamepad, joypad, or controller, an input device used in gaming",
        "Transportation": "Brake pad, part of a drum brake",
        "Music": "Pad, some holes of woodwind instruments (clarinets, saxophones...) are closed by air-tight pads.",
        "Other uses": "Part of a mammal's paw"
    },
    "palm": {
        "Query": "What are the different meanings of the word 'palm'?",
        "Hand": "The palm refers to the central region of the front of the hand.",
        "Plants": "Palm plants belong to the family Arecaceae and there are several genera within this family.",
        "Music": "Palm is the name of an American rock band and also the name of an album by Thrice.",
        "Businesses": "Palm, Inc. was a defunct American electronics manufacturer and Palm Breweries is a Belgian company.",
        "Places": "There are several places named Palm, including one in Pennsylvania and one in Arkansas.",
        "Elsewhere": "There is a place called Palms in Queensland, Australia and Palm Islands in Dubai, United Arab Emirates.",
        "Science and Technology": "Palm can refer to a personal digital assistant (PDA) or an operating system called Palm OS.",
        "Gene": "PALM is a gene found in humans."
    },
    "panel": {
        "Query": "What are the different types of panels used in art?",
        "Arts and media": "Panel painting refers to a technique of creating artwork on a wooden panel.",
        "Science and technology": "Solar panels can be used to power art installations that incorporate renewable energy sources.",
        "Law": "In the context of art forgery cases, a judicial panel may be convened to determine the authenticity of a painting.",
        "Television": "Panel game shows often feature art-related questions or challenges.",
        "People": "Caroline Giron-Panel is a French historian and musicologist who specializes in art history.",
        "Research protocols": "Panel studies can be conducted to analyze the impact of art on individuals over time.",
        "Software": "Panel widgets can be used in graphic design software to create art compositions.",
        "Other physical objects": "Structural insulated panels can be used to construct art exhibition spaces."
    },
    "patch": {
        "Query": "What are the different meanings of the word 'patch'?",
        "Arts, entertainment and media": "Patch Johnson is a fictional character from Days of Our Lives. 'Patches' is a song by Dickey Lee and Chairmen of the Board. Patch Media is an online news service.",
        "People": "Patch Adams is an American physician and clown. Alexander Patch was a WWII U.S. Army general. Harry Patch was a WWI British veteran.",
        "Places": "Patch is a neighborhood in St. Louis, Missouri. The Patch is a locality in Gwbert, Ceredigion, Wales. The Patch is a suburb in Victoria, Australia.",
        "Science and technology": "In computing, a patch refers to changes made to a computer program. In electronics, a patch antenna is used. In medicine, a patch can refer to a large skin lesion or a transdermal patch.",
        "Medicine": "In medicine, a patch can refer to a large skin lesion or a transdermal patch.",
        "Species": "Patch butterflies are species of the genus Chlosyne."
    },
    "period": {
        "Query": "What is the period of a function?",
        "Mathematics": "In mathematics, the period of a function refers to the length or duration after which the function repeats itself.",
        "Science": "In science, the period of a function can also refer to the time needed for one object to complete a cycle or revolution, such as the orbital period or rotation period.",
        "Arts, entertainment, and media": "In arts, entertainment, and media, the term 'period' can be used to describe a specific timeframe in which a particular style of music or art was produced, such as the 'Baroque period' in music.",
        "Common uses": "In common usage, the term 'period' can also refer to a punctuation mark used to indicate the end of a sentence or a menstrual cycle in women."
    },
    "phoenix": {
        "Query": "What are the different meanings of the word 'phoenix' in mythology and places?",
        "Mythology": "Phoenix (mythology), a legendary bird from ancient Greek folklore",
        "Places": "Phoenix, Arizona, a city in the United States"
    },
    "pitch": {
        "Query": "What is the pitch?",
        "Acoustic frequency": "Pitch (music), the perceived frequency of sound including 'definite pitch' and 'indefinite pitch'",
        "Business": "Sales pitch, a line of talk that attempts to persuade someone or something",
        "Measurement": "Pitch angle (or pitch rotation), one of the angular degrees of freedom of any stiff body (for example a vehicle), describing rotation about the side-to-side axis",
        "Angle measurement": "Pitch or grade (slope), the steepness of a slope or an object confirming to a slope",
        "Electromagnetism": "Pitch angle (particle motion), the angle between a charged particle's velocity vector and the local magnetic field",
        "Mechanical engineering": "Pitch angle (engineering), the angle between a bevel gears' element of a pitch cone and its axis",
        "Linear measurement": "'Pitch' is widely used to describe the distance between repeated elements in a structure possessing translational symmetry",
        "Pitch (gear)": "The distance between a point on one tooth and the corresponding point on an adjacent tooth",
        "Arts, entertainment, and media": "Pitch (film)",
        "Plants": "Pitch (resin), a viscous substance produced by plants or formed from petroleum"
    },
    "plane": {
        "Query": "What are the different meanings of the word 'plane'?",
        "Aerospace": "In the field of aerospace, 'plane' refers to a powered, fixed-wing aircraft.",
        "Geometry": "In geometry, 'plane' refers to a flat, 2-dimensional surface.",
        "Mathematics": "In mathematics, 'plane' refers to a generalization of a geometrical plane.",
        "Biology": "In biology, 'plane' can refer to the wetland native plant Platanus or the marsh crabs in the genus Planes.",
        "Maritime Transport": "In maritime transport, 'plane' can refer to planing boats that are supported by hydrodynamic lift or a Norfolk canal boat called a 'plane wherry'.",
        "Music": "In music, 'plane' can refer to songs like 'Planes' by Colin Blunstone, 'Planes (Experimental Aircraft)' by Jefferson Airplane, 'Planez' by Jeremih, or 'The Plane' on the Empire of the Sun soundtrack.",
        "Entertainment": "In the realm of entertainment, 'plane' can refer to fictional realms in Dungeons & Dragons, the animated film 'Planes' and its sequel 'Planes: Fire & Rescue', or the upcoming film 'Plane'. It can also refer to fictional realms in the card game Magic: The Gathering.",
        "Places": "In terms of places, 'plane' can refer to locations such as Plane (Han Pijesak) in Bosnia and Herzegovina, Plane in Tuzla, Bosnia and Herzegovina, Plane River in eastern Germany, Plane Island off Cape Farina in Tunisia, Pláně in the Czech Republic, Planès in France, or Planes in Alicante, Spain.",
        "Religion": "In the realm of religion, 'plane' can refer to a state, level, or region of reality in esotericism or an ancient Greek goddess named Planē."
    },
    "plate": {
        "Query": "What are the different types of plates used in cooking?",
        "Cooking": "Plates, tableware, dishes or dishware used for setting a table, serving food and dining",
        "Science and technology": "Microtiter plate (or microplate or microwell plate), a flat plate with multiple 'wells' used as small test tubes",
        "Metal plates": "Plate (metal), a rectangular flat metal stock that is more than 6 mm or 0.25 in thick, not as thin as sheet metal"
    },
    "plot": {
        "Query": "What is the plot of the movie?",
        "Art, media and entertainment": "The plot of the movie refers to the storyline or narrative arc that unfolds throughout the film, including the main events, conflicts, and resolution.",
        "Music": "The plot of the movie does not have a specific meaning in the context of music.",
        "Other": "The plot of the movie does not have a specific meaning in the other mentioned fields.",
        "Graphics": "The plot of the movie does not have a specific meaning in the context of graphics.",
        "Land": "The plot of the movie does not have a specific meaning in the context of land."
    },
    "point": {
        "Query": "What is the definition of a point?",
        "Mathematics": "A point in mathematics refers to an entity that has a location in space or on a plane, but has no extent. It is an element of some abstract topological space.",
        "Places": "In the context of places, a point can refer to various locations such as Point Lewis in Scotland or Point, Texas in the United States.",
        "Business and Finance": "In business and finance, a point can represent different concepts such as loyalty program points, mortgage points, or basis points used for measuring percentage changes.",
        "Measurement Units": "In terms of measurement units, a point can denote different values such as a gemstone weight measurement, a typographic measurement, or a unit of thickness for paper stock.",
        "Sports": "In the realm of sports, a point can have different meanings depending on the sport, such as scoring points in American football, basketball, or tennis.",
        "Technology and Transport": "In the field of technology and transport, a point can refer to elements in a SCADA system, contact breakers in ignition systems, or clock positions of objects seen from moving vessels or aircraft.",
        "Arts, Entertainment, and Media": "In arts, entertainment, and media, a point can be associated with music albums, record labels, radio shows, or ballet techniques.",
        "Other Uses in Arts, Entertainment, and Media": "In this category, a point can be related to hand evaluation in contract bridge, a French weekly magazine, a radio broadcasting company, or a ballet technique for dancing on the tips of toes."
    },
    "pool": {
        "Query": "What are the different types of pools?",
        "Bodies of water": "Different types of pools include swimming pools, reflecting pools, tide pools, salt pannes and pools, plunge pools, stream pools, and spent fuel pools.",
        "Sports and gambling": "Different types of pools include card pools, domino pools, cue sports pools, poker pools, pool betting, betting pools, football pools, and pool play.",
        "Computing": "Different types of pools include computer science pools, connection pools, memory pools, Memory Pool System, object pool pattern, thread pool pattern, and pooling layers.",
        "Arts and entertainment": "Different types of pools include music albums titled 'Pool', songs titled 'Pool' or 'Pools', films titled 'The Pool' or 'Pool', plays titled 'The Pool', and websites named 'Pool'.",
        "Places": "Different types of pools include locations named Pool in Cornwall and Isles of Scilly, Pool-in-Wharfedale in West Yorkshire, Pool of London, River Pool in London and Cumbria, Pool in West Virginia, and The Pool in Central Park, New York.",
        "Congo": "Pool Department is a division of the Republic of the Congo."
    },
    "portfolio": {
        "Query": "What is the purpose of a portfolio?",
        "Objects": "The purpose of a portfolio (briefcase) is to carry and organize documents, papers, and other items for business or professional purposes.",
        "Collections": "The purpose of a portfolio (finance) is to diversify investments and manage risk by holding a variety of assets such as stocks, bonds, and commodities.",
        "Computing": "The purpose of an Atari Portfolio is to provide a portable computer for personal use, allowing users to perform basic computing tasks on the go.",
        "Media": "The purpose of Portfolio Magazine is to showcase and promote fine arts, providing a platform for artists and art enthusiasts to explore and appreciate various forms of artistic expression."
    },
    "post": {
        "Query": "What are the different meanings of the word 'post'?",
        "Postal services": "Post refers to the mail or postal system, such as An Post in Ireland or Canada Post in Canada.",
        "Work": "Post can also refer to a job or occupation.",
        "Architecture and structures": "Post can refer to a lamppost, a timber framing in architecture, or a utility pole.",
        "Military": "Post can refer to a military base or outpost.",
        "Geography": "Post can refer to a village in Iran, a community in Oregon, or the county seat of Garza County in Texas.",
        "People": "Post can be a surname, such as the musician Post Malone or the botanist George Edward Post.",
        "Dentistry": "Post and core is a type of dental restoration.",
        "Organology": "Post can refer to a key post in a woodwind keywork system.",
        "Arts, entertainment, and media": "Post can refer to albums by artists like Björk or Paul Kelly, or it can refer to a musical change during the intro of a recording.",
        "Periodicals": "Post can refer to magazines like Australasian Post or Post Magazine.",
        "Communications": "Post can refer to an entry in a blog or internet forum, or it can refer to part-of-speech tagging in linguistics.",
        "Computing and technology": "Post can refer to an HTTP request method, an internet top-level domain, or power-on self-test on electronic devices.",
        "Education and training": "Post can refer to a campus of Long Island University, a state-level training program for law enforcement officers, or a university in Connecticut.",
        "Organizations and companies": "Post can refer to the Parliamentary Office of Science and Technology in the UK, Peninsula Open Space Trust in California, or Post Holdings, a consumer packaged goods holding company.",
        "Sports": "Post can refer to an area near the basket in basketball, a route run by a receiver in American football, or a method of horseback riding at the trot.",
        "Time": "The prefix 'post' means after, aftermath, or afterward."
    },
    "pot": {
        "Query": "What are the different types of pots used in cooking?",
        "Containers": "A pot is a type of cookware used for boiling, stewing, or simmering food. It typically has a round shape with a handle and a lid.",
        "Art, entertainment, and media": "In poker, a pot refers to the amount of money or chips that players bet during a hand. The winner of the hand takes the pot.",
        "Plants": "In the context of cannabis, a pot is a slang term for a container used to store and consume marijuana.",
        "Computing and electronics": "A potentiometer, also known as a pot, is a variable resistor used to control the flow of electric current in electronic circuits.",
        "Other uses": "PotashCorp, with the stock symbol POT, is a Canadian fertilizer company."
    },
    "pound": {
        "Query": "What is the value of a pound in US dollars?",
        "Units": "The value of a pound in US dollars fluctuates and is determined by the foreign exchange market.",
        "Symbols": "The pound sign (£) is not used as a symbol for US dollars. The symbol for US dollars is $.",
        "Places in the United States": "The value of a pound in US dollars is not relevant to places in the United States.",
        "Entertainment": "The value of a pound in US dollars is not relevant to entertainment."
    },
    "power": {
        "Query": "What are the different meanings of power?",
        "Common meanings": "Power (physics), meaning 'rate of doing work'",
        "Mathematics, science and technology": "IBM POWER (software), an IBM operating system enhancement package",
        "Mathematics": "Exponentiation, 'x to the power of y'",
        "Physics": "Magnification, the factor by which an optical system enlarges an image",
        "Social sciences and politics": "Economic power, encompassing several concepts that economists use, featuring the word 'power'",
        "Arts, entertainment, and media": "Power (Chainsaw Man), a fictional character from the anime and manga series Chainsaw Man",
        "Films": "Power (1928 film), a comedy film starring William Boyd, Alan Hale and Jacqueline Logan",
        "Literature": "Power (Fast novel), a 1962 novel by Howard Fast",
        "Music": "Power (Alex Newell EP), 2016",
        "Songs": "'Power' (Diljá song), 2023",
        "Radio": "Power 98 (radio station), an English-language radio station in Singapore",
        "Television": "Power (TV series), a 2014 drama series on Starz about a New York City illegal drug network",
        "Other uses in arts, entertainment, and media": "Girl Got Game, originally Power!!, a manga series 1999–2002",
        "People": "Power (name), including a list of people and fictional characters with the surname",
        "Places": "Power (UTA station), a light rail station in Salt Lake City, United States",
        "Sports": "Power (basketball), the 3-on-3 basketball team that plays in the BIG3",
        "Other uses": "Power (angel), a rank in the Christian angelic hierarchy"
    },
    "probe": {
        "Query": "What is the purpose of a probe in films?",
        "Films": "In films, a probe is a type of camera movement where the camera moves closer to a subject or object to reveal more details or create a sense of tension or suspense.",
        "Television": "In television, a probe refers to a type of investigative journalism show where journalists delve deep into a particular topic or issue to uncover hidden truths or expose corruption.",
        "Other entertainment": "In other entertainment, a probe is a parlor game introduced in the 1960s by Parker Brothers where players take turns asking yes or no questions to guess a secret word or phrase."
    },
    "protocol": {
        "Query": "What is the protocol for conducting diplomatic affairs between nation states?",
        "Sociology and politics": "Protocol (diplomacy) refers to the etiquette and formalities followed in diplomatic affairs between nation states.",
        "Science and technology": "In the context of science and technology, protocol refers to a predefined written procedural method of conducting experiments.",
        "Computing": "In computing, protocol can refer to a defined set of rules and regulations that determine how data is transmitted in telecommunications and computer networking.",
        "Music": "Protocol (album) is a music album by Simon Phillips."
    },
    "queue": {
        "Query": "What are the different types of queues in computer science?",
        "Mathematics and technology": "In computer science, there are several types of queues. Some common types include: 1) Queue (abstract data type), which is a basic data structure that follows the First-In-First-Out (FIFO) principle. 2) Circular queue, which is a variation of the basic queue where the last element is connected to the first element. 3) Double-ended queue (deque), which allows insertion and deletion at both ends. 4) Priority queue, where elements are assigned priorities and the highest priority element is dequeued first. 5) Message queue, which is used for inter-process communication and synchronization. 6) Load queue, which represents the system load of a computer's operating system.",
        "Arts, entertainment, and media": "In arts, entertainment, and media, the term 'queue' can refer to the ACM Queue, a computer magazine that focuses on software development and computer science research. It can also refer to 'The Queue', a novel by Russian author Vladimir Sorokin, published in 1983. Additionally, there is another novel titled 'The Queue' written by Egyptian author Basma Abdel Aziz and published in 2013.",
        "Specific queues": "There are specific queues that are associated with certain events or situations. For example, the queue for the lying-in-state of Elizabeth II, often referred to as 'The Queue', is a specific queue that was formed during the event.",
        "Queue area": "In general, a queue area or simply a queue refers to a line or area where people wait for goods or services. It is a common concept in various fields such as retail, transportation, and customer service."
    },
    "race": {
        "Query": "What are the different meanings of the word 'race'?",
        "Biology": "In biology, 'race' refers to an informal taxonomic classification within a species, generally within a sub-species.",
        "Human Categorization": "In human categorization, 'race' refers to the classification of humans into groups based on physical traits and/or social relations.",
        "Competition": "In the context of racing, 'race' refers to a competition of speed.",
        "Movement": "In general, 'race' can also refer to rapid movement.",
        "Yachting": "In yachting, 'race' refers to a specific yachting race.",
        "Mill": "In the context of mills, 'race' refers to the current of water that turns a water wheel or the channel conducting water to or from a water wheel.",
        "Tidal": "In the context of tides, 'race' refers to a fast-moving tide passing through a constriction.",
        "Encoding": "In the field of encoding, 'RACE encoding' refers to a syntax for encoding non-ASCII characters in ASCII.",
        "Emergency Service": "In the US, 'RACE' stands for Radio Amateur Civil Emergency Service, which was established in 1952 for wartime use.",
        "Molecular Biology": "In molecular biology, 'RACE' refers to Rapid Amplification of cDNA Ends, a technique used for amplifying specific RNA sequences.",
        "Robotics": "In the UK, 'RACE' refers to Remote Applications in Challenging Environments, which is a robotics development center.",
        "Automobile Association": "In Spain, 'RACE' refers to an automobile association.",
        "Container": "In the context of shipping, 'RACE' refers to Railways of Australia Container Express, which is a slightly wider version of the standard ISO shipping container.",
        "Automobile Club": "In Spain, 'RACE' also refers to the Royal Automobile Club of Spain.",
        "Fantasy": "In the fantasy genre, 'race' refers to the classification of fictional species.",
        "Play": "In the context of theater, 'Race' is a play written by David Mamet.",
        "Novel": "In literature, 'The Race' is a novel by Richard North Patterson.",
        "Film": "In film, 'Race' can refer to various movies such as a Bollywood thriller, an animated sci-fi film, or a film about African American athlete Jesse Owens.",
        "Television": "In television, 'The Amazing Race' is a US reality television game show franchise.",
        "Games": "In the context of gaming, 'Race' can refer to a computer game or a card game.",
        "Music": "In music, 'The Race' is the name of a UK indie rock band and an album by Pseudo Echo.",
        "Songs": "In the field of music, there are several songs titled 'The Race' by different artists such as Tay-K, Wiz Khalifa, and Yello.",
        "Other Uses": "In other contexts, 'race' can refer to a part of a mechanical device, a surname, a computer programming error, a light rail station, the competition between the US and the Soviet Union in spaceflight, or an alternative term for an election."
    },
    "rack": {
        "Query": "What are the different types of racks used for storage and installation?",
        "Storage and installation": "There are various types of racks used for storage and installation, such as amp racks for mounting amplifiers, bicycle racks for storing bicycles, bustle racks for armored fighting vehicles, drying racks for hanging clothing, firearm racks for storing firearms, pallet racking for palletised loads, roof racks for carrying items on top of a car, standardized equipment racks for computer and AV equipment, and toast racks for serving."
    },
    "radical": {
        "Query": "What is the meaning of radical?",
        "Politics and ideology": "Radical politics refers to the political intent of fundamental societal change, often associated with the Radical Movement that began in late 18th century Britain and spread to other parts of Europe and Latin America in the 19th century.",
        "Ideologies": "Radical feminism is a perspective within feminism that focuses on patriarchy and seeks to challenge and dismantle it. Radical Islam refers to Islamic extremism, which advocates for a strict interpretation of Islamic principles and often promotes violence. Radical Christianity can refer to various interpretations of Christianity that emphasize radical discipleship and social justice.",
        "Science and mathematics": "In chemistry, a radical is an atom, molecule, or ion with unpaired valence electrons. In mathematics, a radical can refer to a mathematical expression involving roots, such as an nth root. It can also represent the radical symbol (√) used to indicate square roots and other roots.",
        "Linguistics": "In linguistics, a radical, also known as a root, refers to the form of a word after any prefixes and suffixes are removed. It can also refer to the radical part of a Chinese character or one of the three consonants in a Semitic root.",
        "Arts and entertainment": "In music, 'Radical' is the title of a mixtape by Odd Future and an album by Every Time I Die. In film, 'Radical' is the title of a Spanish language film set to be released in 2023.",
        "Architecture and design": "The Radical period in late 1960s Italian design was characterized by experimental and unconventional approaches. Radical Baroque is an architectural style known for its dramatic and extravagant features.",
        "Literature": "The book 'Radical: Taking Back Your Faith from the American Dream' by David Platt explores the concept of radical faith. 'Radical: My Journey out of Islamist Extremism' is a memoir by Maajid Nawaz, recounting his personal experience with radicalism.",
        "Mathematics": "In mathematics, a radical can refer to the radical of an algebraic group, an ideal, a ring, a module, an integer, a Lie algebra, or a bilinear form. Each of these concepts has specific definitions and applications within mathematical theory."
    },
    "range": {
        "Query": "What is the range of a function?",
        "Mathematics": "The range of a function refers to the set of all possible output values that the function can produce.",
        "Music": "In music, the range of a function refers to the distance between the lowest and highest pitch that a musical instrument can play.",
        "Science": "In biology, the range of a function refers to the geographical area where a species can be found.",
        "Technology": "In computer programming, the range of a function refers to the set of allowed values for a variable."
    },
    "recognition": {
        "Query": "What are the different types of recognition in machine learning?",
        "Machine Learning": "Pattern recognition is a branch of machine learning that involves the identification and classification of patterns in data. It is used in various applications such as image recognition, speech recognition, and natural language processing.",
        "Biometric": "In machine learning, biometric recognition refers to the identification and verification of individuals based on their unique biological characteristics such as fingerprints, facial features, or iris patterns.",
        "Linguistic": "In machine learning, linguistic recognition involves tasks such as language identification, natural language understanding, speech recognition, and speaker recognition.",
        "Textual": "Textual recognition in machine learning includes tasks like handwriting recognition, optical character recognition, and automatic number plate recognition.",
        "Other meanings in computer science": "In machine learning, there are other types of recognition such as activity recognition, gesture recognition, named entity recognition, object recognition, optical mark recognition, and sound recognition.",
        "Neuroscience and psychology": "In machine learning, recognition in neuroscience and psychology includes visual object recognition, face perception, pareidolia, recall (memory), emotion recognition, and pattern recognition.",
        "Other sciences": "In machine learning, recognition in other sciences includes sociology (recognition of status or merits), immunology (antigen recognition), intra-species recognition, and molecular recognition.",
        "Arts and entertainment": "In machine learning, recognition in arts and entertainment includes works of literature, music, and film that have the word 'recognition' in their titles.",
        "Law": "In machine learning, recognition in law includes parliamentary procedure, tax concepts, family law, diplomatic recognition, and legal recognition.",
        "Other uses": "In machine learning, recognition in other uses includes campaigns, aircraft recognition, and revenue recognition."
    },
    "regression": {
        "Query": "What is the significance of regression in statistics?",
        "Science": "Regression in statistics is used to estimate the relationships between variables and make predictions. It is commonly used in scientific research to analyze data and determine the strength and direction of the relationship between variables.",
        "Statistics": "Regression toward the mean is a statistical phenomenon where extreme values of a variable tend to move closer to the average or mean value over time. It is important to consider when interpreting data and making predictions.",
        "Computing": "Software regression refers to the appearance of a bug or defect in software functionality that was previously working correctly. It can occur due to changes in code, updates, or interactions with other software components.",
        "Hypnosis": "Age regression in therapy is a process used in hypnosis to supposedly retrieve memories from earlier stages of life. It is believed to help individuals gain insight into past experiences and their impact on current behaviors or emotions.",
        "Psychology": "Regression in psychology refers to a defense mechanism where individuals revert to earlier, less mature behaviors or coping mechanisms in response to stress or anxiety. It is considered a form of temporary retreat to a more comfortable or familiar state.",
        "Medicine": "Regression in medicine refers to the characteristic of certain diseases, particularly tumors, to express lighter symptoms or become less extensive without completely disappearing. It is often observed in cancer patients undergoing treatment."
    },
    "representation": {
        "Query": "What is the definition of representation?",
        "Law and politics": "Representation in law and politics refers to the capacity of an agent to act on behalf of a juridical person or sovereign entity, either in legal actions or physical actions where the entity takes on legal replacement liability for the agent's actions.",
        "Arts, entertainment, and media": "Representation in arts, entertainment, and media involves the use of signs or symbols that stand in for and take the place of something else, such as the use of images or language to depict or represent concepts, ideas, or objects.",
        "Cognitive science": "Representation in cognitive science refers to a hypothetical 'internal' cognitive symbol that represents external reality, allowing individuals to process and understand information about the world.",
        "Mathematics": "Representation in mathematics is a general relationship that expresses similarities between objects, such as group representation which describes abstract groups in terms of linear transformations of vector spaces.",
        "Other uses": "Representation in other contexts can refer to various concepts, such as the graphic representation of the molecular structure of a chemical compound in chemistry, or the shared values, beliefs, and practices among members of groups and communities in social representation."
    },
    "resolution": {
        "Query": "What is the resolution?",
        "Common meanings": "Resolution can refer to a statement debated in policy debate, a written motion adopted by a deliberative body, a commitment made at New Year's Day, or the settlement of a disagreement.",
        "Science, technology, and mathematics": "Resolution can refer to various measurements such as audio quality, electron density, angular capability of a sensor, distance that can be accurately measured, amount of detail in an image, capability of an optical system to distinguish details, number of individual dots a printer can produce, smallest change a sensor can detect, capability of an optical system to distinguish different frequencies, separation of peaks in a chromatogram, ability to distinguish peaks in a mass spectrum, pixel width on the ground, sampling frequency of a digital audio device, or reciprocal of the unit in the last place in number storage.",
        "Arts and entertainment": "Resolution can refer to a Star Trek: Voyager episode, a horror movie, a Doctor Who special episode, an episode of the TV show Boardwalk Empire, a meter replacement in poetry, a poem by Bertolt Brecht, a short story by Franz Kafka, a novel by Robert B. Parker or A. N. Wilson.",
        "Music": "Resolution can refer to the move of a note or chord from dissonance to consonance.",
        "Albums": "Resolution can refer to albums by 38 Special, BoDeans, Hamiet Bluiett, Hidden in Plain View, Lamb of God, Andy Timmons, Andy Pratt, or Dave Hause.",
        "EPs": "Resolution can refer to an EP by Matt Corby.",
        "Songs": "Resolution can refer to songs by Matt Corby, Nick Lachey, John Coltrane, Mahavishnu Orchestra, Romantic Mode, Haruka Tomatsu, or Jack's Mannequin.",
        "Business and organizations": "Resolution can refer to a legal document defining authorized individuals for a corporation, a talent agency, a copper mining project, a British think tank, a Guernsey-based investor, or a defunct manager of UK life funds.",
        "Places": "Resolution can refer to a location in the United States Virgin Islands, Nunavut, New Zealand, or the Northwest Territories, Canada."
    },
    "reward": {
        "Query": "What are the different types of rewards in a cashback reward program?",
        "Business and economics": "In a cashback reward program, there are various types of rewards offered to customers. These can include cashback on purchases, gift cards, discounts on future purchases, and exclusive offers.",
        "Arts, entertainment, and media": "In the context of arts, entertainment, and media, the term 'reward' does not specifically refer to different types of rewards in a cashback reward program. It is more commonly associated with songs, films, and operas.",
        "Places": "In the context of places, the term 'reward' does not specifically refer to different types of rewards in a cashback reward program. It is more commonly associated with historic homes and locations such as Reward (Shelltown, Maryland) and Reward-Tilden's Farm.",
        "Machine Learning": "In the context of machine learning, the term 'reward' does not specifically refer to different types of rewards in a cashback reward program. It is more commonly associated with reinforcement learning, where rewards are used to guide the learning process of an agent.",
        "Geography": "In the context of geography, the term 'reward' does not specifically refer to different types of rewards in a cashback reward program. It is more commonly associated with geographic features, locations, and mapping.",
        "Other": "In other fields or contexts, the term 'reward' may have different meanings or applications. It is important to specify the field or context in order to provide a more specific answer."
    },
    "ring": {
        "Query": "What are the different meanings of the word 'ring'?",
        "Jewelry": "A ring is a round band, usually made of metal, worn as ornamental jewelry.",
        "Film and Literature": "The Ring is a Japanese horror media franchise based on the novel series by Koji Suzuki.",
        "Gaming": "Ring is a video game released in 1998.",
        "Music": "Ring is a rock band from the 1980s.",
        "Albums": "Ring is the title of several music albums released by different artists.",
        "Songs": "Ring is the title of several songs released by different artists.",
        "Places": "Ring is a town in County Waterford, Ireland.",
        "Mathematics": "Ring is an algebraic structure in mathematics.",
        "Computers and Electronics": "Ring is a data structure or a network topology in computer science.",
        "Science": "Ring is a cyclic molecule in chemistry or a matter orbiting a planet in astronomy.",
        "Sports": "Ring is the space in which a boxing match occurs or the stage for a professional wrestling match.",
        "Other Arts, Entertainment and Media": "Ring is an episode of the TV series Servant.",
        "People": "Ring is a surname shared by several individuals.",
        "Polyseme": "Ring is a word with multiple meanings across different fields."
    },
    "rock": {
        "Query": "What are the different types of rocks found in geology?",
        "Geology": "In geology, there are three main types of rocks: igneous, sedimentary, and metamorphic. Igneous rocks are formed from the solidification of molten material, sedimentary rocks are formed from the accumulation and lithification of sediments, and metamorphic rocks are formed from the transformation of existing rocks through heat and pressure.",
        "Music": "In rock music, there are various subgenres such as classic rock, alternative rock, punk rock, and heavy metal. Each subgenre has its own distinct sound and characteristics.",
        "Places": "In different places, there are various rock formations and landmarks. For example, the Rock of Gibraltar is a famous landmark in the British overseas territory near Spain, and the Rock of Cashel is a historic site in Ireland.",
        "People": "In terms of people, there are individuals with the surname Rock, like Dwayne Johnson, who is a popular actor and wrestler known as 'The Rock'. There are also musicians and rappers who go by the name Rock, such as the American rapper Rock (Jamal Bush) and the professional wrestler Man Mountain Rock (Maxx Payne).",
        "Arts, Entertainment, and Media": "In arts, entertainment, and media, the term 'rock' can refer to fictional characters like Rock from DC Comics or Rock from Osamu Tezuka's manga series. It can also be used in the titles of albums, songs, and films, such as the album 'Rock' by Pleymo or the film 'Rocks', a British coming-of-age drama.",
        "Computing and Technology": "In computing and technology, 'rock' can refer to the Rock processor developed by Sun Microsystems or the Rocks Cluster Distribution, a Linux distribution for cluster computing.",
        "Food": "In the context of food, 'rock' can refer to rock candy, a type of stick-shaped boiled sugar confectionery, or rock salmon, which is often used to refer to a type of fish.",
        "Slang": "In slang, 'rock' can be used to refer to crack cocaine or diamonds, which are often associated with their hardness and durability.",
        "Sports": "In sports, 'rock' can be associated with various activities. For example, in curling, players slide a stone or rock on ice towards a target area. In stone put or stone skipping, participants throw heavy stones or rocks for distance or accuracy.",
        "Other": "In other contexts, 'rock' can refer to the Rock ski course in China, which is the downhill course for the 2022 Winter Olympics."
    },
    "rod": {
        "Query": "What are the different types of rods used in fishing?",
        "Devices": "A fishing rod is a tool used to catch fish, like a long pole with a hook on the end. It is commonly made of fiberglass, graphite, or bamboo.",
        "Arts and entertainment": "The Rods is an American heavy metal band known for their songs like 'Power Lover' and 'Hurricane'",
        "People": "Rod is a given name that can refer to individuals such as Rod Stewart, a British rock singer, and Rod Serling, an American screenwriter and television producer.",
        "Places": "Ród is a village in Tilişca Commune, Sibiu County, Romania.",
        "Science and technology": "Rod-shaped bacterium is a shape of bacteria such as E. coli."
    },
    "roll": {
        "Query": "What are the different meanings of the word 'roll'?",
        "Physics and engineering": "Rolling, a motion of two objects with respect to each-other such that the two stay in contact without sliding",
        "Food": "Bread roll, a small individual loaf of bread",
        "Arts, entertainment and media": "Roll (Anne McCue album), 2004",
        "People": "Bob Roll (born 1960), American professional cyclist and commentator",
        "de Roll": "Louis de Roll (1750-?), a Swiss soldier during the French Revolutionary and Napoleonic Wars",
        "Rolls": "A luxury car manufactured by Rolls-Royce Limited (1904–1973), Rolls-Royce Motors (1973–1998), or Rolls-Royce Motor Cars (1998–present)",
        "Places": "Roll, Arizona, U.S."
    },
    "round": {
        "Query": "What are the different meanings of the word 'round'?",
        "Mathematics and Science": "In mathematics and science, 'round' can refer to the contour of a closed curve or surface with no sharp corners, such as an ellipse, circle, rounded rectangle, cant, or sphere.",
        "Music": "In music, 'round' can refer to a type of musical composition.",
        "Places": "In the context of places, 'round' can refer to various locations such as The Round, a defunct theatre in Newcastle upon Tyne, or Round Point, a point on the north coast of King George Island.",
        "Repeated Activities": "In the context of repeated activities, 'round' can refer to a time period within a boxing match, a basic crypto transformation in cryptography, or a ritual in medical education and inpatient care called grand rounds."
    },
    "scale": {
        "Query": "What is the scale of a map?",
        "Mathematics": "Scale (ratio), the ratio of the distance on a map to the corresponding actual distance",
        "Measurements": "Scale (map), the ratio of the distance on a map to the corresponding actual distance",
        "Geography": "Scale (map), the ratio of the distance on a map to the corresponding actual distance"
    },
    "scope": {
        "Query": "What is the scope of the project?",
        "Project Management": "The scope of a project refers to the defined boundaries and objectives of the project, including the deliverables, tasks, and resources required to complete it.",
        "Logic": "In logic, the scope of a quantifier refers to the part of a sentence or formula that the quantifier affects. It determines the range of values or objects that the quantifier applies to.",
        "Computing": "In computing, the scope of a variable refers to the part of a program where the variable is accessible and can be referenced. It defines the visibility and lifetime of the variable.",
        "Medicine": "In medicine, the scope of practice refers to the specific procedures, actions, and processes that are permitted for licensed professionals in a particular field, such as doctors, nurses, or therapists."
    },
    "seal": {
        "Query": "What are the different types of seals?",
        "Common uses": "Seals can refer to various marine mammals, such as earless seals, fur seals, and eared seals.",
        "Arts, entertainment and media": "Seals can also refer to albums by the musician Seal, such as Seal (1991 album), Seal (1994 album), and Seal IV.",
        "Law": "In contract law, a seal is a legal formality used for contracts and other instruments. In East Asia, a seal is a stamp used as a form of signature.",
        "Military": "Seals can refer to military aircraft like the Fairey Seal and Supermarine Seal II, as well as naval ships and submarines like HMS Seal and USS Seal.",
        "Special forces": "Seals can refer to special operations forces like the United States Navy SEALs, Thai Navy Seals, Naval Special Operations Command, and ROKN UDT/SEALs.",
        "People": "Seal can refer to the English singer and songwriter Seal, as well as individuals with the surname Seal, such as Aditya Seal, Barry Seal, and Elizabeth Seal.",
        "Places": "Seal can refer to locations like Seal, Kent in England, Seal Beach in California, and Seal Lake in Greenland."
    },
    "segmentation": {
        "Query": "What is the process of dividing a data stream into segments for transmission?",
        "Computing and communications": "TCP segmentation is the process of dividing a data stream into segments for transmission. It is a fundamental aspect of the TCP/IP protocol suite and is used to ensure reliable and efficient data transfer over computer networks.",
        "Biology": "Segmentation in the context of data transmission refers to the division of a data stream into smaller segments that can be transmitted over a network. This process helps in optimizing network performance and ensuring data integrity.",
        "Geometry": "Segmentation in the context of data transmission does not have a direct relevance to geometry.",
        "Language and linguistics": "Segmentation in the context of data transmission does not have a direct relevance to language and linguistics."
    },
    "sell": {
        "Query": "What are the different meanings of the word 'sell'?",
        "People": "Brenda Sell (born 1955), American martial arts instructor and highest ranking non-Korean female practitioner of taekwondo",
        "Acronym": "Syndicat des éditeurs de logiciels de loisirs (SELL), a French organization that promotes the interests of video game developers"
    },
    "server": {
        "Query": "What is the server?",
        "Computing": "A server is a computer program or a device that provides requested information for other programs or devices, called clients.",
        "Role": "A server is a waiting staff who works at a restaurant or a bar attending customers and supplying them with food and drink as requested.",
        "Sports": "A server is a tennis player who makes a serve.",
        "Religion": "A server is an altar server, a lay assistant to a member of the clergy during a Christian liturgy."
    },
    "service": {
        "Query": "What are the different types of service in the restaurant industry?",
        "Economics and business": "In the restaurant industry, there are different types of service, such as table service, where waiters and waitresses serve food directly to customers at their tables. There is also counter service, where customers order and pick up their food at a counter. Additionally, there is buffet service, where customers serve themselves from a variety of food options.",
        "Arts, entertainment, and media": "In the context of arts and entertainment, service can refer to the portrayal of restaurant service in films, plays, or television shows. It can be depicted as a central theme or used as a backdrop for storytelling.",
        "Technology": "In the restaurant industry, technology is increasingly being used to enhance service. This includes the use of self-service kiosks for ordering, mobile apps for table reservations, and digital payment systems for faster and more convenient transactions.",
        "Activities": "In the restaurant industry, service refers to the provision of food and beverages to customers. It involves taking orders, serving food, and ensuring customer satisfaction.",
        "Religion": "In some religious traditions, service may refer to communal meals or gatherings where food is provided to members of the community as an act of worship or charity."
    },
    "set": {
        "Query": "What are the different meanings of the word 'set'?",
        "Science, technology, and mathematics": "Set (mathematics), a collection of elements",
        "Electronics and computing": "Set (abstract data type), a data type in computer science that is a collection of unique values",
        "Biology and psychology": "Set (psychology), a set of expectations which shapes perception or thought",
        "Physics and chemistry": "Set, to make/become solid; see Solidification",
        "Arts and entertainment": "Set, the basic square formation in square dancing",
        "Film, television and theatre": "Set (film and TV scenery)",
        "Music": "Set (music), a collection of discrete entities, for example pitch sets, duration sets, and timbre sets",
        "Businesses and organizations": "SET Index, an index for the Stock Exchange of Thailand",
        "Religion": "Set (deity) or Seth, an ancient Egyptian deity",
        "Sport and games": "Set (card game)",
        "Other uses": "Set and setting, coined by Timothy Leary to describe the mindset and location of hallucinogenic experiences"
    },
    "sheet": {
        "Query": "What are the different types of sheets?",
        "Bedding": "A bed sheet is a rectangular piece of cloth used to cover a mattress and provide a comfortable sleeping surface.",
        "Paper": "A sheet of paper is a flat, thin piece of material made from wood pulp, used for writing, printing, or drawing.",
        "Metalworking": "Sheet metal refers to thin, flat pieces of metal that are used in various applications such as roofing, car bodies, and HVAC systems.",
        "Sailing": "In sailing, a sheet is a line or rope used to control the position of a sail, typically attached to the clew.",
        "Geography": "Sheet, Hampshire is a village and civil parish located in East Hampshire, Hampshire, England.",
        "Archaeology": "Sheets Site is a prehistoric archaeological site located in Fulton County, Illinois, United States.",
        "Mountaineering": "Sheets Peak is a mountain in the Wisconsin Range, Antarctica."
    },
    "show": {
        "Query": "What are the different types of shows in the entertainment industry?",
        "Competition, event, or artistic production": "In the entertainment industry, shows can refer to various types of competitions, events, or artistic productions. These include agricultural shows, animal shows (such as cat shows, dog shows, and horse shows), specialty shows that review a single breed of dog, concerts, radio shows, talk shows, television shows, theatre productions, and trade fairs or trade shows.",
        "Films": "Shows in the context of films can refer to specific movies or films. For example, 'Show' is the title of a 2002 film, 'The Show' is the title of several films released in different years, and 'The Show' is also the title of a 2020 British mystery film.",
        "Albums": "In the music industry, 'show' can refer to albums released by various artists. For instance, there is 'Show' by The Cure (1993), 'Show' by The Jesus Lizard (1994), 'The Show' by eMC (2008), and 'The Show' by Niall Horan (2023). Additionally, 'The Show' is also the title of a soundtrack album from the 1995 hip hop documentary.",
        "Songs": "In the field of music, 'show' can also refer to specific songs. Examples include 'The Show' by Doug E. Fresh, 'The Show' by Girls Aloud, 'The Show' by Lenka, 'The Show' by Reddi, 'The Show' by Hawk Nelson, 'The Show' by Kelly Rowland (featuring Tank), 'The Show' by Tony Harnell, and 'The Show' by Zion I.",
        "Television": "Shows in the context of television can refer to TV series or programs. For example, 'The Show' is the title of a 1997 British TV series and a South Korean music show.",
        "Video games": "'MLB: The Show' is a series of baseball video games.",
        "Other uses in arts, entertainment, and media": "In the broader arts, entertainment, and media industry, 'show' can refer to other entities such as bands (e.g., 'The Show' is an American band), concerts (e.g., 'The Show' is a 2021 online concert by Blackpink), and radio shows (e.g., 'Le Show' is a weekly syndicated public radio show hosted by satirist Harry Shearer).",
        "People": "In terms of people, 'Show' can be a given name or a surname. For example, Show Hayami is a Japanese voice actor, Show Lo is a Taiwanese singer-actor, Eric Show was an American baseball pitcher, and Laurie Show was a murder victim in Pennsylvania.",
        "Nickname": "In the context of nicknames, 'Show' can be used to refer to individuals such as Harold Arceneaux, an American professional basketball player, and Manuel Cafumana, an Angolan footballer."
    },
    "sketch": {
        "Query": "What are the different meanings of the word 'sketch'?",
        "Drawing": "In the context of drawing, a sketch refers to a rapidly executed freehand drawing that is not usually intended as a finished work.",
        "Comedy": "In the context of arts, entertainment, and media, sketch refers to a series of short scenes or vignettes called sketches in sketch comedy.",
        "Film and Television": "In the context of film and television, sketch refers to a Malayalam film titled 'Sketch' released in 2007, a Tamil film titled 'Sketch' released in 2018, a South Korean TV series titled 'Sketch' released in 2018, and an episode of the TV series 'Skins' titled 'Sketch' released in 2008.",
        "Literature": "In the context of literature, sketch refers to a very short piece of writing known as a sketch story or sketch. It can also refer to the British newspaper 'Daily Sketch' published from 1909 to 1971 and the British illustrated weekly journal 'The Sketch' published from 1893 to 1959.",
        "Music": "In the context of music, sketch refers to an informal document prepared by a composer to assist in composition. It can also refer to various albums and bands such as 'Sketch' by Ex Norwegian, 'Sketch' by Hyomin, 'Sketches' by Bert Jansch, 'Sketches' by Ane Brun, 'Sketches' by Newton Faulkner, 'Sketches' by Vince Mendoza, 'Sketches' by Chris Connor, and 'Sketches' by Inga and Anush Arshakyan.",
        "Computing": "In the context of computing, sketch refers to a vector graphics editor called 'Sketch' and another vector graphics editor formerly known as 'Sketch' but now called 'Skencil'. It can also refer to a program written with the Arduino IDE or the Processing IDE.",
        "Mathematics": "In the context of mathematics, sketch refers to techniques for producing a rough idea of the overall shape of a plane curve known as curve sketching. It can also refer to the concept of sketch in the mathematical theory of categories.",
        "People": "In the context of people, sketch refers to Katie Sketch, the vocalist of the band The Organ, and Jason Scott Sadofsky (pseudonym Sketch), an American archivist, filmmaker, and performer."
    },
    "solution": {
        "Query": "What is the solution to the equation x^2 + 4x + 4 = 0?",
        "Chemistry": "In chemistry, a solution refers to a homogeneous mixture where one substance is dissolved in another. Therefore, the question does not make sense in the context of chemistry.",
        "Mathematics": "In mathematics, the solution to the equation x^2 + 4x + 4 = 0 can be found by factoring it as (x + 2)^2 = 0. Therefore, the solution is x = -2.",
        "Numerical Analysis": "In numerical analysis, the solution to the equation x^2 + 4x + 4 = 0 can be approximated using various numerical methods such as Newton's method or the bisection method. The approximate solution depends on the chosen method and error bounds.",
        "Problem Solving": "In problem solving, the solution to the equation x^2 + 4x + 4 = 0 can be found by solving for x using algebraic techniques. The solution is x = -2.",
        "Solution Selling": "In solution selling, the question does not make sense as it is not related to the sales process or providing solutions to customer problems."
    },
    "spring": {
        "Query": "What are the different meanings of the word 'spring'?",
        "Common uses": "Spring (season), a season of the year",
        "Places": "Springs, Gauteng, South Africa",
        "United States": "Springs, New York, a part of East Hampton, New York",
        "People": "Spring (given name)",
        "Groups": "Spring baronets, of Pakenham",
        "Arts, entertainment and media": "The Spring (La Primavera), by Giuseppe Arcimboldo",
        "Film": "Spring (2014 film), an American romantic science fiction horror film",
        "Television": "Spring (TV series), a Flemish-Belgian television series",
        "Literature": "Spring (Kevade), a novel by Oskar Luts, basis for the 1969 film",
        "Music": "Spring (band), an English band, or the band's only album",
        "Albums and EPs": "Spring (Wallows EP), 2018",
        "Songs": "Spring (RMB song), 1996",
        "Classical works": "\"Spring\" (concerto), \"La primavera\", from Vivaldi's The Four Seasons",
        "Other media": "Spring: A Journal of Archetype and Culture, a psychology journal",
        "Brands and organizations": "Spring (company), a computer software company owned by Pivotal Software",
        "Science and technology": "Spring green, occurs between green and cyan in the visible spectrum",
        "Computing": "Spring (application), an E-commerce platform",
        "Other uses": "Sacred spring, a revered spring or well"
    },
    "stake": {
        "Query": "What are the different meanings of the word 'stake'?",
        "Tools": "Archer's stake, survey stakes, sudis (stake), torture stake, steel fence post, side stakes",
        "Entertainment": "Stake: Fortune Fighters (video game), The Stake (silent short film), 'The Stake' (song by The Steve Miller Band), Stakes (miniseries), Stake (band)",
        "People": "Dagnija Staķe (Latvian politician), Robert E. Stake (Professor Emeritus of Education)",
        "Betting and gambling": "Stakes (amount one buys in for while gambling), stakes race, graded stakes race",
        "Companies": "Stake (platform), Stake.com (online casino), @stake (computer services company)"
    },
    "state": {
        "Query": "What are the different meanings of the word 'state'?",
        "Arts, entertainment, and media": "The State (newspaper), a daily newspaper in Columbia, South Carolina, United States",
        "Music": "States Records, an American record label",
        "Television": "The State (American TV series), 1993",
        "Law and politics": "State (polity), a centralized political organization that imposes and enforces rules over a population within a territory",
        "Locations": "State College, Pennsylvania, a city in the United States, often referred to informally as 'State'",
        "Mathematics": "State (controls), a term related to control theory",
        "Science and technology": "State (computer science), a unique configuration of information in a program or machine",
        "Healthcare": "Medical state, one's current state of health, usually within a hospital",
        "Physics and chemistry": "State, a complete description of a system in classical mechanics",
        "Printing": "State (printmaking), distinct revisions of a work by a deliberate change to the print master",
        "Universities": "Ball State University, in Muncie, United States"
    },
    "stem": {
        "Query": "What is the stem?",
        "Science, technology, engineering, and mathematics": "The stem is the structural axis of a vascular plant, providing support and transportation of water, nutrients, and sugars.",
        "Language and writing": "In language and writing, the stem refers to the part of a word responsible for its lexical meaning.",
        "Music and audio": "In music and audio, a stem is a collection of audio sources mixed together to be dealt with downstream as one unit.",
        "Science, technology and transportation": "In science and technology, stem can refer to various things such as scanning transmission electron microscopy, a part of a bicycle, or the most forward part of a boat or ship's bow.",
        "Other": "The query is ambiguous and requires clarification on which specific field the term 'stem' is being referred to."
    },
    "strain": {
        "Query": "What are the different meanings of the word 'strain'?",
        "Science and technology": "In biology, strain refers to variants of plants, viruses, or bacteria used for experimental purposes. In chemistry, strain is a chemical stress of a molecule. In mechanics, strain is a measure of deformation in a material body. In filtration, strain is the process of separating solids from fluids using a strainer. In percolation, strain is the movement and filtering of fluids through porous materials. In psychology, strain refers to psychological stress.",
        "Other uses": "In cooking, straining is the process of separating liquid from solids using a strainer or sieve. In bridge, strain is the indication of either the trump suit or notrump in a bid made in the game of contract bridge. In puréeing, straining is the process of making a mash or purée by forcing it through a sieve.",
        "Proper names": "Strain is a surname.",
        "Arts and media": "In manga, Strain is a 1996 manga written by Yoshiyuki Okamura and illustrated by Ryoichi Ikegami. In music, strain refers to a series of musical phrases that create a distinct melody of a piece. In film, Strain is a 2020 Nigerian drama.",
        "Paired answers": {
            "Science and technology": "Strain (biology) - variants of plants, viruses, or bacteria used for experimental purposes. Strain (chemistry) - a chemical stress of a molecule. Strain (mechanics) - a measure of deformation in a material body. Filtration - separating solids from fluids using a strainer. Percolation - movement and filtering of fluids through porous materials. Psychological stress.",
            "Other uses": "Cooking - separating liquid from solids using a strainer or sieve. Bridge - indication of trump suit or notrump in a bid in contract bridge. Puréeing - making a mash or purée by forcing it through a sieve.",
            "Proper names": "Surname",
            "Arts and media": "Manga - a 1996 manga. Music - a series of musical phrases creating a distinct melody. Film - a 2020 Nigerian drama."
        }
    },
    "stress": {
        "Query": "What are the causes of stress?",
        "Science and medicine": "Stress in biology refers to an organism's response to a stressor, which can be caused by environmental conditions such as temperature, pollution, or lack of food.",
        "Occupational stress": "Occupational stress is caused by factors related to one's job, such as high workload, long working hours, lack of job security, or conflicts with colleagues.",
        "Psychological stress": "Psychological stress can be caused by various factors, including personal relationships, financial problems, traumatic events, or chronic health conditions.",
        "Music": "In music, stress refers to the emphasis or prominence given to a particular note or set of notes, which can be caused by dynamics, rhythm, or melodic patterns.",
        "Albums": "The album 'Stress' by Anonymus was released in 1997, while the album 'Stress: The Extinction Agenda' by Organized Konfusion was released in 1994.",
        "Songs": "The song 'Stress' by Justice was released in 2007, and the song 'Stress' by Odd Børre was released in 1968.",
        "Other arts, entertainment, and media": "The medical journal 'Stress' focuses on research and studies related to stress in the field of medicine. The television series 'The Unit' has an episode titled 'Stress'."
    },
    "strike": {
        "Query": "What are the different meanings of the word 'strike'?",
        "People": "Strike is a surname, such as Hobart Huson, an author of several drug-related books.",
        "Physical confrontation or removal": "Strike can refer to an attack with an inanimate object or a part of the human body intended to cause harm, or a military strike by air forces on either a suspected or a confirmed enemy ground position.",
        "Refusal to work or perform": "Strike can refer to a work stoppage caused by the mass refusal of employees to perform work, or a hunger strike where participants fast as an act of political protest.",
        "Science and technology": "Strike can refer to an obsolete unit of volume, an access control device used for doors, or electrical discharges caused by lightning.",
        "Sport": "Strike can refer to a term used in bowling, a term used in soccer to mean an accurate, driven shot, or a term used in baseball to define the area where a pitch is considered a strike.",
        "Arts, entertainment, and media": "Strike can refer to a lost Australian film, a silent film made in the Soviet Union by Sergei Eisenstein, or a British dance band formed in 1994.",
        "Music": "Strike can refer to a British dance band formed in 1994, a New Zealand percussion group formed in 1993, or an album by Southern rock band Blackfoot.",
        "Television": "Strike can refer to a BBC series based on the Cormoran Strike detective book series, an episode of the NBC sitcom Seinfeld, or an episode of The Comic Strip Presents.",
        "Video games": "Strike can refer to a video game series released during 1991–1997 by Electronic Arts, or cooperative multiplayer modes in the video game Destiny.",
        "Other uses in arts, entertainment, and media": "Strike can refer to the Japanese name for the Pokémon Scyther, a fictional counter-terrorism and intelligence agency in the Marvel Comics universe, or a film production company founded in 2002 by Marc Abraham and Thomas Bliss."
    },
    "swift": {
        "Query": "What is the SWIFT code for international bank transactions?",
        "Banking": "The SWIFT code, also known as the Bank Identifier Code (BIC), is a unique identification code used to facilitate international bank transactions. It is a standard format of Bank Identifier Codes approved by the International Organization for Standardization (ISO)."
    },
    "tablet": {
        "Query": "What are the different types of tablets?",
        "Medicine": "Tablet (pharmacy), a mixture of pharmacological substances pressed into a small cake or bar, colloquially called a 'pill'.",
        "Computing": "Tablet computer, a mobile computer that is primarily operated by touching the screen.",
        "Confectionery": "Tablet (confectionery), a medium-hard, sugary confection from Scotland.",
        "Inscription, printing, and writing media": "Clay tablet, one of the earliest known writing mediums.",
        "Periodicals and printed works": "Tablet (magazine), a daily online magazine of Jewish news, ideas, and culture."
    },
    "tag": {
        "Query": "What are the different meanings of the word 'tag'?",
        "Identification and tracking": "Tag (graffiti), a form of graffiti signature",
        "Arts, entertainment, and media": "Tag (comics), a Marvel character",
        "Films": "Tag (2015 film), a 2015 Japanese film",
        "Music": "Tag (barbershop music), a dramatic variation in the last section of a song",
        "Television": "Tag (TV channel), a defunct Philippine TV channel",
        "Theatre": "TAG Theatre Company, a touring theatre company in Scotland",
        "Other arts, entertainment, and media": "Tag (advertisement), a sportswear commercial",
        "Brands and enterprises": "TAG Body Spray",
        "Computing": "TAG (BBS), bulletin board software",
        "Government and political organizations": "State adjutant general, US",
        "Language and education": "Tag (Hebrew writing), a decoration",
        "Natural science": "3-methyladenine DNA glycosylase I, called TAG in E. coli",
        "People with surname Tag": "Katrin Lea Tag (born 1972), German scenic designer and costume designer",
        "Sport": "Tag (game), a playground game"
    },
    "tap": {
        "Query": "What are the different meanings of the word 'tap'?",
        "Arts and entertainment": "Tap (film), a 1989 American dance drama film",
        "Gaming": "Tap (gaming), a mechanic in Magic: The Gathering and other card games where a card is rotated",
        "Music and dancing": "Tap dance, a type of dance using the sounds of tap shoes striking the floor",
        "Publications": "Tap!, a defunct magazine for owners of Apple's iOS devices",
        "Businesses and organisations": "TAP Air Portugal, Portugal's flag carrier airline",
        "Medicine": "Lumbar puncture, also known as a spinal tap",
        "People": "Tap Canutt (1932–2014), American stunt performer and actor",
        "Places": "Tap, Azerbaijan",
        "Science and technology": "Tap (valve), a device for controlling the release of a liquid or gas, e.g. a water faucet",
        "Computing and communications": "Tap (signal processing), a delayed impulse response",
        "Science": "Tap consonant, a type of phonetic sound",
        "Transportation": "Trans Adriatic Pipeline (TAP), a gas pipeline via Greece, Albania and Italy"
    },
    "terminal": {
        "Query": "What are the different types of terminals in computing?",
        "Hardware": "A terminal (electronics) is a device for joining electrical circuits together.",
        "Telecommunication": "A terminal (telecommunication) is a device used for communication over a line.",
        "Computer Science": "A computer terminal is a set of primary input and output devices for a computer.",
        "Software": "A terminal emulator is a program that emulates a computer terminal within some other display architecture."
    },
    "thread": {
        "Query": "What are the different types of thread used in sewing?",
        "Objects": "Thread (yarn), a kind of thin yarn used for sewing",
        "Arts and entertainment": "Thread (film), 2016 Greek film",
        "Music": "Thread (album), 2018, by American rock band Red Sun Rising",
        "Technology": "Threads (social network), an online social media and social networking service launched in 2023 by Meta Platforms",
        "Programming": "Thread (computing), a sequence of instructions that may execute in parallel with others",
        "Other uses": "Ariadne's thread (logic), a method for solving a problem with multiple apparent means of proceeding."
    },
    "tie": {
        "Query": "What are the different types of ties in the fashion industry?",
        "Fashion": "In the fashion industry, there are several types of ties, including neckties, bow ties, ascot ties, and cravats. Each type of tie has its own unique style and is worn for different occasions or with different types of clothing.",
        "Engineering and Technology": "In engineering and technology, a tie can refer to a fastening device used to secure two objects together. It can be a metal or plastic component designed to provide strength and stability.",
        "Sports": "In sports, a tie refers to a finish to a competition with identical results. It can occur in various sports such as soccer, basketball, or tennis, where both teams or players have the same score at the end of the game.",
        "Business": "In the business world, a tie can refer to a professional dress code. It is a long piece of cloth worn around the neck, typically by men, as part of formal attire in professional settings.",
        "Science": "In science, ties can be used to describe interpersonal connections or relationships between individuals. It can also refer to specific types of cell surface receptors known as TIE receptors.",
        "People": "In the context of people, Tie can be a surname or a given name. There are several individuals with the surname Tie, such as Tahir Tie Domi, a retired Canadian ice hockey player, and Li Tie, a Chinese retired footballer and coach."
    },
    "tissue": {
        "Query": "What is the function of tissue?",
        "Biology": "In biology, tissue refers to an ensemble of similar (or dissimilar in structure but same in origin) cells that together carry out a specific function. It is the basic structural unit of all living organisms.",
        "Textiles": "In textiles, tissue refers to a lightweight, thin, and translucent fabric often used for delicate garments or decorative purposes.",
        "Architecture": "In architecture, tissue refers to a flexible and adaptable material system that can be used to create complex and dynamic structures.",
        "Music": "In music, tissue refers to a technique used in organ playing where a sustained note is played with one hand while the other hand plays a series of rapid notes.",
        "Medical": "In medicine, tissue refers to a collection of cells that perform a specific function in the body. It can be classified into four main types: epithelial, connective, muscle, and nervous tissue."
    },
    "tone": {
        "Query": "What is the tone of this painting?",
        "Color-related": "In color theory, tone refers to the mix of tint and shade in a painting, which determines the lightness or darkness of a color.",
        "Sound and music": "In the context of sound and music, tone refers to the audible characteristics of a musician's sound, including pitch, intensity, and timbre.",
        "Musical genres, groups, people and works": "In the context of musical genres, groups, people, and works, tone can refer to a specific album or band, such as the album 'Tone' by Jeff Ament or the band Tone from DC.",
        "Places": "In geography, Tone can refer to different locations such as Tone in Gunma, Japan or Tone in Somerset, England.",
        "Physiology": "In physiology, tone can refer to the state of tension or responsiveness of the organs or tissues of the body, such as muscle tone.",
        "Other": "The term 'tone' can have various other meanings depending on the specific field or context in which it is used."
    },
    "unity": {
        "Query": "What is the significance of unity in religion?",
        "Religion": "Unity in religion refers to the belief in the oneness of God and the unity of all religious teachings. It emphasizes the common values and principles shared by different religions, promoting tolerance, understanding, and cooperation among believers.",
        "Politics": "Unity in religion can also be a political concept, where religious unity is seen as a means to foster social cohesion and stability within a society.",
        "Education": "In the context of education, unity in religion can be taught as a way to promote respect for diversity and religious tolerance among students.",
        "Philosophy": "Unity in religion can be a philosophical concept, exploring the interconnectedness of different religious traditions and seeking to find common ground and universal truths.",
        "Media and Entertainment": "Unity in religion can be a theme explored in movies, books, and music, highlighting the power of faith and spirituality to bring people together.",
        "Science and Technology": "Unity in religion can also be studied from a scientific perspective, examining the psychological and social effects of religious unity on individuals and communities."
    },
    "value": {
        "Query": "What is the value of a company?",
        "Ethics and social": "The value of a company in ethics and social context refers to the moral worth or importance attributed to the company's actions and impact on society.",
        "Economics": "The value of a company in economics refers to its market capitalization or the monetary worth of the company based on its assets, liabilities, and future earnings potential.",
        "Business": "The value of a company in a business context refers to its ability to generate revenue, profit, and shareholder value.",
        "Other uses": "The value of a company in other uses could refer to its reputation, brand value, or intangible assets such as intellectual property."
    },
    "vector": {
        "Query": "What are the different types of vectors in mathematics and physics?",
        "Mathematics and physics": "In mathematics and physics, there are several types of vectors. Euclidean vectors are the most common type, which have both magnitude and direction. There are also row and column vectors, which are single row or column matrices. Vector spaces are mathematical structures that consist of vectors and satisfy certain axioms. Vector fields assign a vector to each point in a given space."
    },
    "vision": {
        "Query": "What are the different meanings of the word 'vision'?",
        "Perception": "Vision refers to the sense of sight and the physical mechanism of eyesight.",
        "Perception of the future": "Vision can also refer to the ability to foresee future market trends and plan accordingly in business.",
        "Other perceptions": "In spirituality, vision can refer to a supernatural experience that conveys a revelation or a hallucination, which is a perception of something that does not exist.",
        "Arts and media": "In the context of arts and media, vision can refer to events such as science fiction conventions or art festivals.",
        "Film and television": "Vision can also refer to films, television shows, and TV channels with 'Vision' in their titles.",
        "Literature": "In literature, vision can refer to comic book characters, magazines, novels, or science books.",
        "Music": "Vision can also refer to albums and songs with 'Vision' in their titles.",
        "Buildings": "Vision can refer to planned skyscrapers or existing towers with 'Vision' in their names.",
        "Businesses and organizations": "Vision can refer to nightclubs, airlines, fitness equipment companies, media companies, political parties, or road traffic safety projects.",
        "Religion": "In religion, 'The Vision' can refer to a revelation in the Latter Day Saint movement.",
        "Science and technology": "Vision can refer to fields such as computer vision, machine vision, cookware brands, game engines, IRC clients, mobile browsers, space exploration plans, or portable media players.",
        "Vehicles": "Vision can refer to aircraft, cars, ships, or cruise ships with 'Vision' in their names."
    },
    "warrant": {
        "Query": "What is the legal definition of warrant?",
        "Law": "In law, a warrant is a form of specific authorization, such as an arrest warrant that authorizes the arrest and detention of an individual, or a search warrant that authorizes law enforcement to conduct a search for evidence.",
        "Philosophy": "In philosophy, a warrant is a proper justification for holding a belief, or the assumption or principle that connects data to a claim.",
        "Rhetoric": "In rhetoric, a warrant is the assumption or principle that connects data to a claim.",
        "Business": "In business, a warrant is a financial instrument that gives the holder the right, without obligation, to buy or sell something at an agreed price.",
        "Finance": "In finance, a warrant is a financial instrument that gives the holder the right, without obligation, to buy or sell something at an agreed price.",
        "Films": "In films, 'The Warrant' is a 2020 American film directed by Brent Christy.",
        "Music": "In music, 'Warrant' is an American glam metal band from Hollywood, California.",
        "Arts": "In arts, 'Warrant' is a German speed metal band that formed in 1983."
    },
    "web": {
        "Query": "What are the different meanings of the word 'web'?",
        "Spider web": "A silken structure created by spiders to catch prey or build their homes.",
        "World Wide Web": "An Internet-based hypertext system that allows the sharing of information and resources.",
        "Computing": "WEB, a literate programming system created by Donald Knuth.",
        "Engineering": "Web (manufacturing), continuous sheets of material passed over rollers.",
        "Films": "Web (2013 film), a documentary.",
        "Literature": "Web (comics), a MLJ comicbook character (created 1942).",
        "Mathematics": "Web (differential geometry), a type of set allowing an intrinsic Riemannian-geometry characterisation of the additive separation of variables in the Hamilton–Jacobi equation.",
        "Music": "Web Entertainment, a record label.",
        "People": "W. E. B. Du Bois (1868–1963), African-American sociologist, historian, civil rights activist, author and editor.",
        "Radio": "WEBS (AM), a radio station licensed to Calhoun, Georgia, United States.",
        "Television": "The Web (1950 TV series), a 1950–1954 American mystery/suspense anthology television series that was broadcast on CBS.",
        "Other uses": "West-East Bag, an international women artists network active from 1971 to 1973."
    },
    "yield": {
        "Query": "What is the yield of a chemical reaction?",
        "Computer Science": "In computer science, yield refers to an action that occurs in a computer program during multithreading.",
        "Physics/Chemistry": "In physics/chemistry, yield refers to the amount of product obtained in a chemical reaction.",
        "Earth Science": "In earth science, yield refers to the measurement of the amount of a crop harvested or animal products produced per unit area of land.",
        "Production/Manufacturing": "In production/manufacturing, yield refers to the measure of functioning devices in semiconductor testing or the number of servings provided by a recipe."
    },
    "yolo": {
        "Query": "What is the meaning of YOLO?",
        "Phrases": "YOLO is an aphorism that stands for 'you only live once'. It is often used to encourage people to take risks and live life to the fullest.",
        "Places": "YOLO can refer to various places such as Yolo, California, Yolo County, California, Yolo County Airport, Yolo City (formerly Woodland, California), or Yolo, Mali (a village).",
        "Arts and entertainment": "YOLO can be a song title, such as 'YOLO' by The Lonely Island or 'YOLO' by Band-Maid. It can also refer to an album, like 'YOLO' by Dia. Additionally, it has been featured in TV series episodes, such as 'YOLO' in The Simpsons or 'YOLO' in Scandal.",
        "Television": "YOLO can refer to TV series, such as the 2016 Ghanaian TV series 'YOLO' or the 2020 animated series for Adult Swim also titled 'YOLO'. It has also been featured in specific TV series episodes, like 'YOLO' in The Simpsons or 'YOLO' in Scandal.",
        "Science and technology": "YOLO can refer to a type of reflecting telescope called the Yolo telescope, or it can refer to the YOLO algorithm (You Only Look Once), which is an algorithm used for object detection."
    }
}